[
  ["arroser", "to water", "Je dois arroser les plantes soigneusement chaque matin avant d'aller au travail.", "I must water the plants carefully every morning before going to work."],
  ["un cartable", "a schoolbag", "L'élève a oublié son cartable dans la classe après avoir terminé ses devoirs.", "The student forgot his schoolbag in the classroom after finishing his homework."],
  ["un taille-crayon", "a pencil sharpener", "J'ai besoin d'un taille-crayon pour affûter mes crayons avant l'examen important.", "I need a pencil sharpener to sharpen my pencils before the important exam."],
  ["soigneusement", "carefully", "Elle a étudié soigneusement tous les documents avant de prendre une décision importante.", "She studied all the documents carefully before making an important decision."],
  ["tirer", "to pull", "Il faut tirer la porte avec force car elle est coincée depuis l'accident de la semaine dernière.", "You have to pull the door hard because it's been stuck since last week's accident."],
  ["une cantine", "a cafeteria", "Les élèves mangent à la cantine tous les jours, mais ils préfèrent parfois apporter leur déjeuner.", "The students eat in the cafeteria every day, but they sometimes prefer to bring their lunch."],
  ["pleurant", "crying", "En pleurant, l'enfant a expliqué à sa mère pourquoi il était triste après l'école.", "While crying, the child explained to his mother why he was sad after school."],
  ["gaiement", "cheerfully", "Elle chante gaiement en préparant le dîner pour sa famille ce soir.", "She sings cheerfully while preparing dinner for her family tonight."],
  ["ramassons", "we collect", "Nous ramassons les coquillages sur la plage chaque été pendant nos vacances en famille.", "We collect shells on the beach every summer during our family vacation."],
  ["des coquillages", "shells", "Les enfants ont trouvé de beaux coquillages sur la plage après la tempête d'hier.", "The children found beautiful shells on the beach after yesterday's storm."],
  ["des congés", "vacation/holidays", "Pendant les congés d'été, nous voyageons toujours à l'étranger pour découvrir de nouvelles cultures.", "During summer vacation, we always travel abroad to discover new cultures."],
  ["créer", "to create", "L'artiste veut créer une nouvelle œuvre d'art qui exprime ses sentiments profonds.", "The artist wants to create a new artwork that expresses his deep feelings."],
  ["un milieu", "a middle/medium", "Au milieu de la forêt, il y a une petite cabane où nous aimons nous reposer.", "In the middle of the forest, there's a small cabin where we like to rest."],
  ["couper", "to cut", "Il faut couper les légumes en petits morceaux avant de les mettre dans la soupe.", "You need to cut the vegetables into small pieces before putting them in the soup."],
  ["arriver", "to arrive", "Nous allons arriver à l'aéroport à l'heure grâce à l'accompagnement de notre chauffeur expérimenté.", "We will arrive at the airport on time thanks to our experienced driver's accompaniment."],
  ["une parole", "a word/speech", "Chaque parole qu'il prononce est importante car il est le directeur de l'entreprise.", "Every word he speaks is important because he is the company director."],
  ["parfois", "sometimes", "Parfois, il est difficile de comprendre les règles de grammaire française, mais avec de la pratique, tout devient plus clair.", "Sometimes, it's difficult to understand French grammar rules, but with practice, everything becomes clearer."],
  ["colorions", "we color", "Nous colorions les dessins avec des crayons de couleur pendant l'activité artistique de l'après-midi.", "We color the drawings with colored pencils during the afternoon art activity."],
  ["la cour", "the courtyard", "Les élèves jouent dans la cour de récréation pendant la pause, mais ils doivent être prudents.", "The students play in the schoolyard during recess, but they must be careful."],
  ["des renards", "foxes", "Nous avons vu des renards dans la forêt pendant notre promenade du dimanche matin.", "We saw foxes in the forest during our Sunday morning walk."],
  ["semer", "to sow/plant", "Les fermiers vont semer les graines au printemps pour avoir une bonne récolte en automne.", "The farmers will sow the seeds in spring to have a good harvest in autumn."],
  ["lancer", "to throw/launch", "Il va lancer la balle à son ami qui joue au baseball dans le parc.", "He will throw the ball to his friend who plays baseball in the park."],
  ["des inondations", "floods", "Les inondations ont causé beaucoup de dégâts dans la région, mais les habitants restent optimistes.", "The floods caused a lot of damage in the region, but the residents remain optimistic."],
  ["le vent", "the wind", "Le vent souffle fort aujourd'hui, c'est pourquoi nous ne pouvons pas faire de pique-nique dehors.", "The wind is blowing hard today, which is why we can't have a picnic outside."],
  ["la neige", "the snow", "La neige tombe doucement sur la ville, créant un paysage magnifique et paisible.", "The snow falls gently on the city, creating a beautiful and peaceful landscape."],
  ["une cheminée", "a chimney", "La fumée sort de la cheminée de la vieille maison, indiquant que quelqu'un y habite encore.", "Smoke comes out of the chimney of the old house, indicating that someone still lives there."],
  ["une sécheresse", "a drought", "La sécheresse de cet été a été si grave que les agriculteurs ont perdu une grande partie de leurs récoltes.", "This summer's drought was so severe that farmers lost a large part of their crops."],
  ["le brouillard", "the fog", "Le brouillard est si épais ce matin qu'on ne peut pas voir à plus de dix mètres devant soi.", "The fog is so thick this morning that you can't see more than ten meters ahead."],
  ["la pluie", "the rain", "La pluie tombe depuis trois jours, mais les météorologues prédisent du soleil pour demain.", "It has been raining for three days, but meteorologists predict sunshine for tomorrow."],
  ["pleuve", "may it rain", "J'espère qu'il pleuve bientôt car le jardin a vraiment besoin d'eau après cette longue période de sécheresse.", "I hope it rains soon because the garden really needs water after this long dry period."],
  ["il pleut", "it's raining", "Il pleut des cordes depuis ce matin, c'est pourquoi nous sommes restés à la maison toute la journée.", "It's been raining cats and dogs since this morning, which is why we stayed home all day."],
  ["un orage", "a thunderstorm", "L'orage était si violent hier soir que nous avons dû éteindre tous les appareils électroniques.", "The thunderstorm was so violent last night that we had to turn off all electronic devices."],
  ["une écharpe", "a scarf", "Elle porte une belle écharpe en laine qu'elle a tricotée elle-même pendant l'hiver dernier.", "She is wearing a beautiful wool scarf that she knitted herself last winter."],
  ["un terminus", "a terminus", "Le bus s'arrête au terminus de la ligne 15, d'où nous devons prendre un autre transport pour aller au centre-ville.", "The bus stops at the terminus of line 15, where we need to take another transport to go downtown."],
  ["une épicerie", "a grocery store", "L'épicerie du coin est ouverte tous les jours, même le dimanche, ce qui est très pratique pour les habitants.", "The corner grocery store is open every day, even Sunday, which is very convenient for residents."],
  ["une inscription", "an enrollment/registration", "L'inscription à l'université se fait en ligne maintenant, ce qui facilite beaucoup le processus pour les étudiants.", "University enrollment is done online now, which makes the process much easier for students."],
  ["des horaires", "schedules/timetables", "Les horaires des trains ont changé à cause des travaux sur la ligne, mais les passagers sont informés à l'avance.", "Train schedules have changed due to work on the line, but passengers are informed in advance."],
  ["un secrétariat", "a secretariat/office", "Le secrétariat de l'école est ouvert de 8h à 17h pour répondre aux questions des parents et des élèves.", "The school office is open from 8am to 5pm to answer questions from parents and students."],
  ["une facture", "a bill/invoice", "Je dois payer la facture d'électricité avant la fin du mois, sinon il y aura des frais supplémentaires.", "I need to pay the electricity bill before the end of the month, otherwise there will be additional fees."],
  ["mieux", "better", "Il se sent mieux maintenant qu'il a pris ses médicaments et qu'il a eu une bonne nuit de sommeil.", "He feels better now that he has taken his medication and had a good night's sleep."],
  ["le cœur", "the heart", "Le cœur de la ville est très animé le soir avec tous ses restaurants et ses cafés ouverts jusqu'à tard.", "The heart of the city is very lively in the evening with all its restaurants and cafes open until late."],
  ["le feu", "the fire", "Le feu de cheminée réchauffe agréablement la pièce pendant les froides soirées d'hiver.", "The fireplace fire pleasantly warms the room during cold winter evenings."],
  ["neuf", "new", "Cette voiture est toute neuf et elle consomme très peu d'essence, ce qui est parfait pour l'environnement.", "This car is brand new and it consumes very little gas, which is perfect for the environment."],
  ["une garderie", "a daycare", "La garderie accueille les enfants de 6 mois à 4 ans et propose de nombreuses activités éducatives.", "The daycare welcomes children from 6 months to 4 years old and offers many educational activities."],
  ["un cheveu", "a hair", "Il a un cheveu blanc qui apparaît de temps en temps, mais il reste très jeune d'esprit.", "He has a white hair that appears from time to time, but he remains very young at heart."],
  ["une épée", "a sword", "L'épée du chevalier était très lourde, mais il savait parfaitement s'en servir pour défendre le royaume.", "The knight's sword was very heavy, but he knew how to use it perfectly to defend the kingdom."],
  ["une pelote", "a ball (of yarn)", "Ma grand-mère tricote avec une pelote de laine bleue qu'elle a achetée au marché artisanal.", "My grandmother knits with a ball of blue wool that she bought at the craft market."],
  ["un collier", "a necklace", "Elle porte un collier en or que sa mère lui a offert pour son anniversaire de mariage.", "She wears a gold necklace that her mother gave her for her wedding anniversary."],
  ["une canette", "a can", "Il a jeté la canette de soda dans la poubelle de recyclage après avoir fini de boire.", "He threw the soda can in the recycling bin after finishing drinking."],
  ["une olarie", "an oil mill", "L'olarie produit de l'huile d'olive de très bonne qualité grâce aux olives récoltées dans la région.", "The oil mill produces very good quality olive oil thanks to the olives harvested in the region."],
  ["un couteau", "a knife", "Le couteau de cuisine est très tranchant, il faut faire attention quand on l'utilise pour couper les légumes.", "The kitchen knife is very sharp, you need to be careful when using it to cut vegetables."],
  ["un pompier", "a firefighter", "Le pompier a sauvé plusieurs personnes de l'incendie grâce à son courage et à son expérience.", "The firefighter saved several people from the fire thanks to his courage and experience."],
  ["une baignoire", "a bathtub", "La baignoire est très confortable et profonde, parfaite pour se détendre après une longue journée de travail.", "The bathtub is very comfortable and deep, perfect for relaxing after a long day of work."],
  ["un canapé", "a sofa", "Le canapé du salon est si confortable que nous nous endormons souvent dessus en regardant la télévision.", "The living room sofa is so comfortable that we often fall asleep on it while watching television."],
  ["un dé", "a die", "Il lance le dé sur la table de jeu et espère obtenir un six pour gagner la partie.", "He throws the die on the game table and hopes to get a six to win the game."],
  ["une fée", "a fairy", "La fée a accordé trois vœux à la petite fille qui l'avait aidée dans la forêt magique.", "The fairy granted three wishes to the little girl who had helped her in the magical forest."],
  ["une fusée", "a rocket", "La fusée spatiale a été lancée avec succès vers la station spatiale internationale ce matin.", "The space rocket was successfully launched toward the international space station this morning."],
  ["une poupée", "a doll", "La petite fille joue avec sa poupée préférée en lui racontant des histoires imaginaires.", "The little girl plays with her favorite doll by telling her imaginary stories."],
  ["un chevalier", "a knight", "Le chevalier courageux a combattu le dragon pour sauver la princesse prisonnière dans le château.", "The brave knight fought the dragon to save the princess imprisoned in the castle."],
  ["un épicier", "a grocer", "L'épicier du quartier connaît tous ses clients par leur prénom et leurs habitudes d'achat.", "The neighborhood grocer knows all his customers by their first name and their shopping habits."],
  ["un métier", "a profession/job", "Il a choisi le métier d'enseignant parce qu'il aime transmettre ses connaissances aux jeunes générations.", "He chose the teaching profession because he likes to pass on his knowledge to young generations."],
  ["une épingle", "a pin", "Elle utilise une épingle pour attacher sa broche sur sa robe avant d'aller à la soirée élégante.", "She uses a pin to attach her brooch to her dress before going to the elegant party."],
  ["un crayon", "a pencil", "L'élève a besoin d'un crayon bien taillé pour écrire clairement pendant l'examen de mathématiques.", "The student needs a well-sharpened pencil to write clearly during the mathematics exam."],
  ["une gomme", "an eraser", "Elle utilise sa gomme pour effacer les erreurs dans son cahier d'exercices de français.", "She uses her eraser to erase mistakes in her French exercise book."],
  ["un cahier", "a notebook", "Chaque élève doit avoir un cahier pour noter les leçons importantes du professeur.", "Each student must have a notebook to write down the teacher's important lessons."],
  ["une règle", "a ruler", "La règle de 30 centimètres est parfaite pour tracer des lignes droites dans le cahier de géométrie.", "The 30-centimeter ruler is perfect for drawing straight lines in the geometry notebook."],
  ["une feuille", "a sheet/leaf", "L'automne arrive et les feuilles des arbres commencent à changer de couleur dans le parc.", "Autumn is coming and the tree leaves are starting to change color in the park."],
  ["un stylo", "a pen", "Il écrit une lettre d'amour avec son stylo préféré qu'il a reçu en cadeau de sa grand-mère.", "He writes a love letter with his favorite pen that he received as a gift from his grandmother."],
  ["le tableau", "the blackboard/board", "Le professeur écrit les exercices au tableau pendant que les élèves copient dans leurs cahiers.", "The teacher writes the exercises on the board while the students copy them in their notebooks."],
  ["un livre", "a book", "Ce livre d'histoire est très intéressant car il raconte la vie des rois de France au Moyen Âge.", "This history book is very interesting because it tells the story of the kings of France in the Middle Ages."],
  ["une trousse", "a pencil case", "La trousse de l'élève contient tous ses stylos, crayons et gommes nécessaires pour les cours.", "The student's pencil case contains all his pens, pencils and erasers needed for classes."],
  ["un étui", "a case", "Il range ses lunettes dans un étui en cuir pour les protéger quand il ne les porte pas.", "He stores his glasses in a leather case to protect them when he's not wearing them."],
  ["un pot à crayons", "a pencil holder", "Le pot à crayons sur le bureau est rempli de stylos de toutes les couleurs pour les projets artistiques.", "The pencil holder on the desk is filled with pens of all colors for art projects."],
  ["un sac à dos", "a backpack", "L'élève met ses livres et ses cahiers dans son sac à dos avant d'aller à l'école le matin.", "The student puts his books and notebooks in his backpack before going to school in the morning."],
  ["un surligneur", "a highlighter", "Elle utilise un surligneur jaune pour marquer les passages importants dans son livre de cours.", "She uses a yellow highlighter to mark important passages in her course book."],
  ["une agrafeuse", "a stapler", "L'agrafeuse est très utile pour assembler les feuilles de papier avant de les ranger dans le classeur.", "The stapler is very useful for assembling sheets of paper before storing them in the binder."],
  ["un trombone", "a paperclip", "Il utilise un trombone pour maintenir ensemble les documents importants qu'il doit présenter demain.", "He uses a paperclip to hold together the important documents he needs to present tomorrow."],
  ["une punaise", "a thumbtack", "Elle accroche l'affiche sur le mur avec une punaise pour que tout le monde puisse la voir.", "She hangs the poster on the wall with a thumbtack so everyone can see it."],
  ["un cartable", "a schoolbag", "Le cartable de l'élève est lourd car il contient tous ses livres et ses fournitures scolaires.", "The student's schoolbag is heavy because it contains all his books and school supplies."],
  ["un classeur", "a binder", "Le classeur est organisé avec des intercalaires pour séparer les différentes matières scolaires.", "The binder is organized with dividers to separate the different school subjects."],
  ["un bâton de colle", "a glue stick", "L'enfant utilise un bâton de colle pour coller les images dans son cahier d'activités manuelles.", "The child uses a glue stick to stick the pictures in his craft activity book."],
  ["un ruban adhésif", "adhesive tape", "Le ruban adhésif transparent est parfait pour réparer les pages déchirées du livre de bibliothèque.", "Transparent adhesive tape is perfect for repairing torn pages of the library book."],
  ["le correcteur", "the correction fluid", "Le correcteur blanc permet d'effacer les erreurs d'écriture sans abîmer le papier.", "White correction fluid allows erasing writing mistakes without damaging the paper."],
  ["une table", "a table", "La table de la salle à manger est assez grande pour accueillir toute la famille lors des repas du dimanche.", "The dining room table is large enough to accommodate the whole family during Sunday meals."],
  ["une chaise", "a chair", "Cette chaise en bois est très confortable et elle a été fabriquée par un artisan local.", "This wooden chair is very comfortable and it was made by a local craftsman."],
  ["la porte", "the door", "La porte de la classe reste ouverte pendant les cours pour permettre une bonne circulation de l'air.", "The classroom door stays open during classes to allow good air circulation."],
  ["une fenêtre", "a window", "La fenêtre de la chambre donne sur un beau jardin fleuri où les oiseaux chantent le matin.", "The bedroom window overlooks a beautiful flower garden where birds sing in the morning."],
  ["le rideau", "the curtain", "Le rideau de la fenêtre est en tissu épais pour empêcher la lumière du soleil d'entrer le matin.", "The window curtain is made of thick fabric to prevent sunlight from entering in the morning."],
  ["la poubelle", "the trash can", "Il faut vider la poubelle régulièrement pour éviter les mauvaises odeurs dans la cuisine.", "You need to empty the trash can regularly to avoid bad smells in the kitchen."],
  ["des haut-parleurs", "speakers", "Les haut-parleurs de la salle de concert sont très puissants et permettent d'entendre parfaitement la musique.", "The concert hall speakers are very powerful and allow you to hear the music perfectly."],
  ["un tableau d'affichage", "a bulletin board", "Le tableau d'affichage de l'école contient toutes les informations importantes pour les élèves et les parents.", "The school bulletin board contains all the important information for students and parents."],
  ["une affiche", "a poster", "L'affiche publicitaire sur le mur de la rue attire l'attention des passants avec ses couleurs vives.", "The advertising poster on the street wall attracts the attention of passersby with its bright colors."],
  ["un projecteur", "a projector", "Le professeur utilise un projecteur pour montrer des images et des vidéos pendant ses cours d'histoire.", "The teacher uses a projector to show images and videos during his history classes."],
  ["une calculatrice", "a calculator", "La calculatrice scientifique est autorisée pendant l'examen de mathématiques pour les calculs complexes.", "The scientific calculator is allowed during the mathematics exam for complex calculations."],
  ["un marqueur pour le tableau", "a board marker", "Le marqueur pour le tableau est presque vide, il faut le remplacer avant le prochain cours.", "The board marker is almost empty, it needs to be replaced before the next class."],
  ["des ciseaux", "scissors", "Les ciseaux de couture sont très tranchants et permettent de couper le tissu avec précision.", "The sewing scissors are very sharp and allow cutting fabric with precision."],
  ["des feutres", "markers", "Les feutres de couleur permettent aux enfants de dessiner et de colorier avec des couleurs vives.", "Colored markers allow children to draw and color with bright colors."],
  ["des marqueurs de couleur", "colored markers", "Les marqueurs de couleur sont parfaits pour créer des graphiques colorés dans les présentations professionnelles.", "Colored markers are perfect for creating colorful charts in professional presentations."],
  ["des crayons de couleur", "colored pencils", "Les crayons de couleur permettent de créer des dessins détaillés avec des nuances subtiles.", "Colored pencils allow creating detailed drawings with subtle shades."],
  ["un effaceur", "an eraser", "L'effaceur pour tableau efface parfaitement les marques de feutre sans laisser de traces.", "The board eraser perfectly erases marker marks without leaving traces."],
  ["une efface", "an eraser", "L'efface en caoutchouc est douce et n'abîme pas le papier quand on efface les erreurs.", "The rubber eraser is soft and doesn't damage the paper when erasing mistakes."],
  ["à demain", "see you tomorrow", "À demain, j'espère que tu auras une bonne journée et que nous pourrons continuer notre conversation.", "See you tomorrow, I hope you have a good day and we can continue our conversation."],
  ["à la prochaine", "see you next time", "À la prochaine, j'ai hâte de te revoir et de discuter de nos projets futurs ensemble.", "See you next time, I look forward to seeing you again and discussing our future projects together."],
  ["samedi", "Saturday", "Samedi, nous allons au marché pour acheter des légumes frais et rencontrer nos amis du quartier.", "On Saturday, we're going to the market to buy fresh vegetables and meet our neighborhood friends."],
  ["mardi", "Tuesday", "Mardi, j'ai un rendez-vous important avec mon médecin pour discuter des résultats de mes analyses.", "On Tuesday, I have an important appointment with my doctor to discuss my test results."],
  ["dimanche", "Sunday", "Dimanche, nous aimons nous promener en famille dans le parc et pique-niquer près du lac.", "On Sunday, we like to take family walks in the park and picnic near the lake."],
  ["mercredi", "Wednesday", "Mercredi, les enfants n'ont pas école, c'est pourquoi nous organisons des activités amusantes à la maison.", "On Wednesday, children don't have school, which is why we organize fun activities at home."],
  ["jeudi", "Thursday", "Jeudi, je vais au cours de français pour améliorer ma prononciation et apprendre de nouveaux mots.", "On Thursday, I go to French class to improve my pronunciation and learn new words."],
  ["vendredi", "Friday", "Vendredi soir, nous sortons dîner au restaurant pour célébrer la fin de la semaine de travail.", "On Friday evening, we go out to dinner at a restaurant to celebrate the end of the work week."],
  ["lundi", "Monday", "Lundi matin, il est parfois difficile de se lever tôt après le week-end, mais il faut bien commencer la semaine.", "On Monday morning, it's sometimes difficult to get up early after the weekend, but you have to start the week."],
  ["janvier", "January", "Janvier est le mois le plus froid de l'année, mais c'est aussi le moment des bonnes résolutions pour la nouvelle année.", "January is the coldest month of the year, but it's also the time for good resolutions for the new year."],
  ["février", "February", "Février est un mois court mais il apporte souvent de belles surprises avec les premiers signes du printemps.", "February is a short month but it often brings beautiful surprises with the first signs of spring."],
  ["mars", "March", "Mars marque le début du printemps et c'est le moment idéal pour planter des fleurs dans le jardin.", "March marks the beginning of spring and it's the perfect time to plant flowers in the garden."],
  ["avril", "April", "Avril apporte souvent des averses, mais c'est aussi le mois où la nature reprend vie après l'hiver.", "April often brings showers, but it's also the month when nature comes back to life after winter."],
  ["mai", "May", "Mai est le mois des fleurs et des promenades en plein air, c'est pourquoi tout le monde aime cette période.", "May is the month of flowers and outdoor walks, which is why everyone loves this time."],
  ["juin", "June", "Juin marque le début de l'été et c'est le moment des vacances d'été pour les écoliers.", "June marks the beginning of summer and it's time for summer vacation for schoolchildren."],
  ["juillet", "July", "Juillet est le mois le plus chaud de l'année et c'est le moment idéal pour partir en vacances à la mer.", "July is the hottest month of the year and it's the perfect time to go on vacation to the seaside."],
  ["août", "August", "Août est le mois des grandes vacances et beaucoup de gens partent en voyage pour profiter du beau temps.", "August is the month of summer vacation and many people go on trips to enjoy the good weather."],
  ["septembre", "September", "Septembre marque la rentrée scolaire et c'est le moment de reprendre les bonnes habitudes après les vacances.", "September marks the start of the school year and it's time to get back into good habits after vacation."],
  ["octobre", "October", "Octobre apporte les belles couleurs de l'automne et c'est le moment de la récolte des pommes.", "October brings the beautiful colors of autumn and it's time for apple harvest."],
  ["novembre", "November", "Novembre est un mois pluvieux mais c'est aussi le moment de préparer l'hiver et de rester au chaud chez soi.", "November is a rainy month but it's also time to prepare for winter and stay warm at home."],
  ["décembre", "December", "Décembre est le mois de Noël et des fêtes de fin d'année, c'est pourquoi tout le monde est de bonne humeur.", "December is the month of Christmas and year-end celebrations, which is why everyone is in a good mood."],
  ["rêver", "to dream", "Il aime rêver d'un monde meilleur où tous les enfants pourraient aller à l'école et apprendre librement.", "He likes to dream of a better world where all children could go to school and learn freely."],
  ["nager", "to swim", "Elle apprend à nager dans la piscine municipale avec un maître-nageur très patient et expérimenté.", "She learns to swim in the municipal pool with a very patient and experienced swimming instructor."],
  ["une caissière", "a cashier", "La caissière du supermarché est très souriante et elle connaît la plupart de ses clients réguliers.", "The supermarket cashier is very smiling and she knows most of her regular customers."],
  ["des écureuils", "squirrels", "Les écureuils du parc sont très malins et ils savent exactement où cacher leurs noix pour l'hiver.", "The park squirrels are very clever and they know exactly where to hide their nuts for winter."],
  ["bavard", "chatty/talkative", "Il est très bavard en classe et il pose toujours beaucoup de questions intéressantes au professeur.", "He is very talkative in class and he always asks many interesting questions to the teacher."],
  ["des jumelles", "binoculars", "Les jumelles permettent d'observer les oiseaux dans leur habitat naturel sans les déranger.", "Binoculars allow observing birds in their natural habitat without disturbing them."],
  ["des échecs", "chess", "Les échecs sont un jeu de stratégie qui développe la logique et la concentration des joueurs.", "Chess is a strategy game that develops players' logic and concentration."],
  ["des oreilles", "ears", "Les oreilles des lapins sont très sensibles et elles leur permettent d'entendre les dangers de loin.", "Rabbits' ears are very sensitive and they allow them to hear dangers from far away."],
  ["un loup", "a wolf", "Le loup hurle la nuit dans la forêt, mais il n'est pas dangereux pour les humains s'ils restent à distance.", "The wolf howls at night in the forest, but it's not dangerous to humans if they stay at a distance."],
  ["épeler", "to spell", "Il faut épeler son nom clairement au téléphone pour éviter les erreurs de communication importantes.", "You need to spell your name clearly on the phone to avoid important communication errors."],
  ["un chiffre", "a number", "Ce chiffre représente le nombre d'habitants de la ville et il augmente chaque année avec les nouveaux arrivants.", "This number represents the number of city inhabitants and it increases every year with new arrivals."],
  ["des genoux", "knees", "Les genoux des enfants sont souvent écorchés car ils jouent beaucoup dehors et tombent parfois.", "Children's knees are often scraped because they play a lot outside and sometimes fall."],
  ["une veuve", "a widow", "La veuve âgée vit seule dans sa maison, mais ses voisins l'aident régulièrement avec les courses.", "The elderly widow lives alone in her house, but her neighbors regularly help her with shopping."],
  ["un veuf", "a widower", "Le veuf a perdu sa femme il y a deux ans, mais il garde de beaux souvenirs de leur vie commune.", "The widower lost his wife two years ago, but he keeps beautiful memories of their life together."],
  ["des jumeaux", "twins", "Les jumeaux sont identiques et ils se ressemblent tellement qu'il est difficile de les distinguer.", "The twins are identical and they look so much alike that it's difficult to tell them apart."],
  ["un pupitre", "a desk", "Le pupitre de l'élève est en bois et il contient un tiroir pour ranger ses affaires personnelles.", "The student's desk is made of wood and it contains a drawer to store his personal belongings."],
  ["comment dit-on", "how do you say", "Comment dit-on 'merci' en japonais ? Je voudrais apprendre quelques mots de politesse.", "How do you say 'thank you' in Japanese? I would like to learn a few polite words."],
  ["des loisirs", "leisure activities", "Les loisirs sont importants pour se détendre et oublier les soucis du travail pendant le week-end.", "Leisure activities are important for relaxing and forgetting work worries during the weekend."],
  ["des activités préférées", "favorite activities", "Ses activités préférées sont la lecture et la peinture, qu'elle pratique chaque dimanche après-midi.", "Her favorite activities are reading and painting, which she practices every Sunday afternoon."],
  ["ça s'écrit comment", "how do you spell it", "Ça s'écrit comment votre nom de famille ? Je voudrais l'écrire correctement sur cette liste.", "How do you spell your last name? I would like to write it correctly on this list."],
  ["sourire", "to smile", "Il sourit toujours quand il voit ses petits-enfants jouer dans le jardin de la maison familiale.", "He always smiles when he sees his grandchildren playing in the family home garden."],
  ["souriant", "smiling", "La vendeuse souriante accueille chaleureusement tous les clients qui entrent dans la boutique.", "The smiling saleswoman warmly welcomes all customers who enter the store."],
  ["un jour férié", "a public holiday", "Le jour férié est l'occasion de se reposer et de passer du temps en famille sans penser au travail.", "The public holiday is an opportunity to rest and spend time with family without thinking about work."],
  ["reculer", "to move back", "Il faut reculer la voiture de quelques mètres pour laisser passer le camion de livraison.", "You need to back up the car a few meters to let the delivery truck pass."],
  ["une journée de fête", "a celebration day", "La journée de fête est organisée par la mairie pour célébrer l'anniversaire de la ville.", "The celebration day is organized by the town hall to celebrate the city's anniversary."],
  ["l'été", "summer", "L'été est la saison préférée des enfants car ils peuvent jouer dehors et aller à la plage.", "Summer is children's favorite season because they can play outside and go to the beach."],
  ["l'hiver", "winter", "L'hiver est froid et sombre, mais c'est aussi le moment des sports d'hiver et des soirées au coin du feu.", "Winter is cold and dark, but it's also time for winter sports and evenings by the fireside."],
  ["l'automne", "autumn", "L'automne apporte de belles couleurs dans les arbres et c'est le moment de la récolte des fruits.", "Autumn brings beautiful colors in the trees and it's time for fruit harvest."],
  ["une naissance", "a birth", "La naissance d'un enfant est toujours un moment de joie et d'espoir pour toute la famille.", "The birth of a child is always a moment of joy and hope for the whole family."],
  ["on célèbre", "we celebrate", "On célèbre l'anniversaire de mariage des grands-parents avec toute la famille réunie dans le jardin.", "We celebrate the grandparents' wedding anniversary with the whole family gathered in the garden."],
  ["que fais-tu dans la vie", "what do you do for a living", "Que fais-tu dans la vie ? J'aimerais connaître ton métier et tes centres d'intérêt professionnels.", "What do you do for a living? I would like to know your profession and your professional interests."],
  ["qu'est-ce que tu fais dans la vie", "what do you do for a living", "Qu'est-ce que tu fais dans la vie ? Je suis curieux de découvrir ton parcours professionnel et tes projets.", "What do you do for a living? I'm curious to discover your professional background and your projects."],
  ["quelles sont tes activités préférées", "what are your favorite activities", "Quelles sont tes activités préférées ? J'aimerais organiser quelque chose qui te plaît vraiment.", "What are your favorite activities? I would like to organize something you really like."],
  ["quelles sont tes loisirs", "what are your hobbies", "Quelles sont tes loisirs ? Je cherche des idées pour occuper mes week-ends de manière agréable.", "What are your hobbies? I'm looking for ideas to occupy my weekends in a pleasant way."],
  ["quelle est ta date de naissance", "what is your date of birth", "Quelle est ta date de naissance ? J'ai besoin de cette information pour remplir le formulaire d'inscription.", "What is your date of birth? I need this information to fill out the registration form."],
  ["quand es-tu arrivé à Québec", "when did you arrive in Quebec", "Quand es-tu arrivé à Québec ? Je voudrais savoir depuis combien de temps tu vis dans cette belle ville.", "When did you arrive in Quebec? I would like to know how long you have been living in this beautiful city."],
  ["quelle est ta pointure de soulier", "what is your shoe size", "Quelle est ta pointure de soulier ? Je voudrais t'offrir une paire de chaussures pour ton anniversaire.", "What is your shoe size? I would like to give you a pair of shoes for your birthday."],
  ["quels moyens de déplacement utilises-tu", "what means of transportation do you use", "Quels moyens de déplacement utilises-tu ? Je suis curieux de connaître tes habitudes de transport quotidien.", "What means of transportation do you use? I'm curious to know your daily transport habits."],
  ["une amende", "a fine", "Il a reçu une amende pour excès de vitesse, mais il a appris sa leçon et conduit plus prudemment maintenant.", "He received a fine for speeding, but he learned his lesson and drives more carefully now."],
  ["un plancher", "a floor", "Le plancher de la cuisine est en carrelage, ce qui est pratique pour le nettoyage après les repas.", "The kitchen floor is tiled, which is practical for cleaning after meals."],
  ["un plafond", "a ceiling", "Le plafond de la chambre est haut et il y a une belle poutre en bois qui donne du caractère à la pièce.", "The bedroom ceiling is high and there's a beautiful wooden beam that gives character to the room."],
  ["une lumière", "a light", "La lumière du soleil entre par la fenêtre et illumine agréablement toute la pièce le matin.", "Sunlight comes through the window and pleasantly illuminates the whole room in the morning."],
  ["un interrupteur", "a switch", "L'interrupteur de la lampe est situé près de la porte pour faciliter l'éclairage de la pièce.", "The lamp switch is located near the door to facilitate room lighting."],
  ["une bouche d'aération", "a ventilation vent", "La bouche d'aération permet de renouveler l'air dans la salle de bain et d'éviter l'humidité.", "The ventilation vent allows air renewal in the bathroom and prevents humidity."],
  ["une horloge", "a clock", "L'horloge murale indique midi et elle sonne douze coups pour annoncer l'heure du déjeuner.", "The wall clock shows noon and it strikes twelve times to announce lunch time."],
  ["un tapis", "a rug", "Le tapis du salon est en laine naturelle et il apporte de la chaleur et du confort à la pièce.", "The living room rug is made of natural wool and it brings warmth and comfort to the room."],
  ["les effets scolaires", "school supplies", "Les effets scolaires sont rangés soigneusement dans le cartable pour être prêts pour la rentrée.", "School supplies are carefully stored in the schoolbag to be ready for back to school."],
  ["les fournitures scolaires", "school supplies", "Les fournitures scolaires coûtent cher chaque année, mais elles sont nécessaires pour bien étudier.", "School supplies are expensive every year, but they are necessary to study well."],
  ["une clé USB", "a USB key", "La clé USB contient tous les documents importants du projet et elle est sauvegardée régulièrement.", "The USB key contains all the important project documents and it is backed up regularly."],
  ["un volet", "a shutter", "Le volet de la fenêtre est fermé pour protéger la pièce du soleil et de la chaleur de l'été.", "The window shutter is closed to protect the room from sun and summer heat."],
  ["un rideau", "a curtain", "Le rideau de la chambre est épais et il empêche la lumière du matin d'entrer trop tôt.", "The bedroom curtain is thick and it prevents morning light from entering too early."],
  ["une étagère", "a shelf", "L'étagère de la bibliothèque est remplie de livres intéressants que nous lisons pendant nos loisirs.", "The library shelf is filled with interesting books that we read during our leisure time."],
  ["un écran", "a screen", "L'écran de l'ordinateur est grand et il permet de voir clairement tous les détails des documents.", "The computer screen is large and it allows seeing all document details clearly."],
  ["un clavier", "a keyboard", "Le clavier de l'ordinateur est ergonomique et il permet de taper rapidement sans fatigue.", "The computer keyboard is ergonomic and it allows typing quickly without fatigue."],
  ["une prise de courant", "an electrical outlet", "La prise de courant est située près du bureau pour brancher facilement l'ordinateur et la lampe.", "The electrical outlet is located near the desk to easily plug in the computer and lamp."],
  ["veuillez à être", "please be", "Veuillez à être ponctuel pour la réunion importante de demain matin à neuf heures précises.", "Please be punctual for tomorrow morning's important meeting at exactly nine o'clock."],
  ["le drapeau", "the flag", "Le drapeau français flotte au vent devant la mairie et il symbolise l'unité de la nation.", "The French flag flies in the wind in front of the town hall and it symbolizes the unity of the nation."],
  ["une souris", "a mouse", "La souris de l'ordinateur fonctionne parfaitement et elle permet de naviguer facilement sur l'écran.", "The computer mouse works perfectly and it allows easy navigation on the screen."],
  ["un élève", "a student", "L'élève travaille dur pour réussir ses examens et il espère obtenir de bonnes notes.", "The student works hard to pass his exams and he hopes to get good grades."],
  ["les devoirs", "homework", "Les devoirs sont importants pour réviser les leçons et préparer les prochains cours à l'école.", "Homework is important to review lessons and prepare for upcoming classes at school."],
  ["un mur", "a wall", "Le mur de la chambre est peint en bleu clair et il donne une impression d'espace et de sérénité.", "The bedroom wall is painted light blue and it gives an impression of space and serenity."],
  ["un feutre", "a marker", "Le feutre rouge est utilisé pour souligner les mots importants dans le texte du cours de français.", "The red marker is used to underline important words in the French course text."]
]
