[
  [
    "je peux",
    "I can",
    "Je peux t'aider à déménager ce week-end si tu veux.",
    "I can help you move this weekend if you want. (Présent)"
  ],
  [
    "tu peux",
    "you can (informal)",
    "Tu peux venir avec nous au cinéma ce soir?",
    "Can you come with us to the movies tonight? (Présent)"
  ],
  [
    "il/elle/on peut",
    "he/she can",
    "Elle peut parler cinq langues couramment.",
    "She can speak five languages fluently. (Présent)"
  ],
  [
    "nous pouvons",
    "we can",
    "Nous pouvons partir en vacances dès que tu es prêt.",
    "We can go on vacation as soon as you're ready. (Présent)"
  ],
  [
    "vous pouvez",
    "you can (formal)",
    "Vous pouvez m'appeler à tout moment si vous avez des questions.",
    "You can call me anytime if you have questions. (Présent)"
  ],
  [
    "ils/elles peuvent",
    "they can",
    "Ils peuvent résoudre ce problème mathématique en quelques minutes.",
    "They can solve this math problem in a few minutes. (Présent)"
  ],
  [
    "je pouvais",
    "I could",
    "Quand j'étais enfant, je pouvais courir très vite sans me fatiguer.",
    "When I was a child, I could run very fast without getting tired. (Imparfait)"
  ],
  [
    "tu pouvais",
    "you could (informal)",
    "Tu pouvais rester éveillé toute la nuit quand tu étais plus jeune.",
    "You could stay awake all night when you were younger. (Imparfait)"
  ],
  [
    "il/elle/on pouvait",
    "he/she could",
    "Il pouvait jouer du piano pendant des heures sans s'arrêter.",
    "He could play the piano for hours without stopping. (Imparfait)"
  ],
  [
    "nous pouvions",
    "we could",
    "Nous pouvions voir les étoiles chaque soir depuis notre jardin.",
    "We could see the stars every evening from our garden. (Imparfait)"
  ],
  [
    "vous pouviez",
    "you could (formal)",
    "Vous pouviez entendre le chant des oiseaux tôt le matin.",
    "You could hear the birds singing early in the morning. (Imparfait)"
  ],
  [
    "ils/elles pouvaient",
    "they could",
    "Ils pouvaient se souvenir de tous les détails de leurs voyages.",
    "They could remember all the details of their trips. (Imparfait)"
  ],
  [
    "j'ai pu",
    "I have been able to",
    "J'ai pu finir mon livre avant la fin du mois grâce à mes efforts.",
    "I have been able to finish my book before the end of the month thanks to my efforts. (Passé Composé)"
  ],
  [
    "tu as pu",
    "you have been able to (informal)",
    "Tu as pu réparer ta voiture toi-même, c'est impressionnant!",
    "You have been able to fix your car yourself, that's impressive! (Passé Composé)"
  ],
  [
    "il/elle/on a pu",
    "he/she has been able to",
    "Elle a pu convaincre son patron de lui donner une promotion.",
    "She has been able to convince her boss to give her a promotion. (Passé Composé)"
  ],
  [
    "nous avons pu",
    "we have been able to",
    "Nous avons pu trouver un appartement dans le centre-ville malgré la pénurie.",
    "We have been able to find an apartment downtown despite the shortage. (Passé Composé)"
  ],
  [
    "vous avez pu",
    "you have been able to (formal)",
    "Vous avez pu surmonter tous ces obstacles avec détermination.",
    "You have been able to overcome all these obstacles with determination. (Passé Composé)"
  ],
  [
    "ils/elles ont pu",
    "they have been able to",
    "Ils ont pu organiser une fête surprise pour leur ami sans qu'il le sache.",
    "They have been able to organize a surprise party for their friend without him knowing. (Passé Composé)"
  ],
  [
    "je pourrai",
    "I will be able to",
    "Je pourrai t'aider à déménager la semaine prochaine, promis!",
    "I will be able to help you move next week, I promise! (Futur Simple)"
  ],
  [
    "tu pourras",
    "you will be able to (informal)",
    "Tu pourras enfin réaliser ton rêve de voyager en Asie l'année prochaine.",
    "You will finally be able to realize your dream of traveling to Asia next year. (Futur Simple)"
  ],
  [
    "il/elle/on pourra",
    "he/she will be able to",
    "Elle pourra commencer son nouveau travail dès le mois prochain.",
    "She will be able to start her new job as early as next month. (Futur Simple)"
  ],
  [
    "nous pourrons",
    "we will be able to",
    "Nous pourrons enfin acheter cette maison dont nous rêvons depuis des années.",
    "We will finally be able to buy this house we've been dreaming of for years. (Futur Simple)"
  ],
  [
    "vous pourrez",
    "you will be able to (formal)",
    "Vous pourrez prendre votre retraite dans quelques années et profiter de la vie.",
    "You will be able to retire in a few years and enjoy life. (Futur Simple)"
  ],
  [
    "ils/elles pourront",
    "they will be able to",
    "Ils pourront célébrer leur anniversaire de mariage dans leur restaurant préféré.",
    "They will be able to celebrate their wedding anniversary at their favorite restaurant. (Futur Simple)"
  ],
  [
    "j'avais pu",
    "I had been able to",
    "J'avais pu terminer tous mes devoirs avant que mes parents rentrent à la maison.",
    "I had been able to finish all my homework before my parents came home. (Plus-Que-Parfait)"
  ],
  [
    "tu avais pu",
    "you had been able to (informal)",
    "Tu avais pu réserver les billets de concert avant qu'ils ne soient épuisés.",
    "You had been able to book the concert tickets before they sold out. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait pu",
    "he/she had been able to",
    "Il avait pu sauver tous ses fichiers importants avant que l'ordinateur ne plante.",
    "He had been able to save all his important files before the computer crashed. (Plus-Que-Parfait)"
  ],
  [
    "nous avions pu",
    "we had been able to",
    "Nous avions pu trouver un hôtel pas cher avant que les prix n'augmentent.",
    "We had been able to find a cheap hotel before prices went up. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez pu",
    "you had been able to (formal)",
    "Vous aviez pu éviter l'accident en freinant à temps.",
    "You had been able to avoid the accident by braking in time. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient pu",
    "they had been able to",
    "Ils avaient pu finir leur marathon avant que la pluie ne commence à tomber.",
    "They had been able to finish their marathon before the rain started falling. (Plus-Que-Parfait)"
  ],
  [
    "j'aurai pu",
    "I will have been able to",
    "D'ici la fin de l'année, j'aurai pu économiser assez d'argent pour partir en voyage.",
    "By the end of the year, I will have been able to save enough money to go on a trip. (Futur Antérieur)"
  ],
  [
    "tu auras pu",
    "you will have been able to (informal)",
    "Tu auras pu apprendre les bases de cette langue avant ton départ.",
    "You will have been able to learn the basics of this language before your departure. (Futur Antérieur)"
  ],
  [
    "il/elle/on aura pu",
    "he/she will have been able to",
    "Il aura pu terminer sa thèse avant la date limite grâce à son travail acharné.",
    "He will have been able to finish his thesis before the deadline thanks to his hard work. (Futur Antérieur)"
  ],
  [
    "nous aurons pu",
    "we will have been able to",
    "Nous aurons pu visiter tous les musées de la ville avant de repartir.",
    "We will have been able to visit all the museums in the city before leaving. (Futur Antérieur)"
  ],
  [
    "vous aurez pu",
    "you will have been able to (formal)",
    "Vous aurez pu régler tous les détails administratifs avant votre départ en retraite.",
    "You will have been able to settle all the administrative details before your retirement. (Futur Antérieur)"
  ],
  [
    "ils/elles auront pu",
    "they will have been able to",
    "Ils auront pu organiser leur mariage de rêve avant la fin de l'été.",
    "They will have been able to organize their dream wedding before the end of summer. (Futur Antérieur)"
  ],
  [
    "je pourrais",
    "I could/would be able to",
    "Je pourrais t'aider à réparer ta vélo si tu veux, j'ai quelques outils.",
    "I could help you fix your bike if you want, I have some tools. (Conditionnel Présent)"
  ],
  [
    "tu pourrais",
    "you could/would be able to (informal)",
    "Tu pourrais peut-être venir un peu plus tôt pour m'aider à préparer le dîner?",
    "Could you maybe come a bit earlier to help me prepare dinner? (Conditionnel Présent)"
  ],
  [
    "il/elle/on pourrait",
    "he/she could/would be able to",
    "Elle pourrait gagner ce concours si elle s'entraînait davantage.",
    "She could win this competition if she trained more. (Conditionnel Présent)"
  ],
  [
    "nous pourrions",
    "we could/would be able to",
    "Nous pourrions aller au cinéma ce soir si tu n'as rien d'autre de prévu.",
    "We could go to the movies tonight if you don't have anything else planned. (Conditionnel Présent)"
  ],
  [
    "vous pourriez",
    "you could/would be able to (formal)",
    "Vous pourriez peut-être nous donner plus de détails sur ce projet?",
    "Could you perhaps give us more details about this project? (Conditionnel Présent)"
  ],
  [
    "ils/elles pourraient",
    "they could/would be able to",
    "Ils pourraient réussir leur examen s'ils étudiaient un peu plus chaque jour.",
    "They could pass their exam if they studied a bit more each day. (Conditionnel Présent)"
  ],
  [
    "j'aurais pu",
    "I would have been able to",
    "J'aurais pu t'aider à déménager si tu m'avais prévenu plus tôt.",
    "I would have been able to help you move if you had told me earlier. (Conditionnel Passé)"
  ],
  [
    "tu aurais pu",
    "you would have been able to (informal)",
    "Tu aurais pu éviter cette erreur si tu avais relu ton travail.",
    "You would have been able to avoid this mistake if you had proofread your work. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait pu",
    "he/she would have been able to",
    "Elle aurait pu gagner la course si elle n'avait pas trébuché à la fin.",
    "She would have been able to win the race if she hadn't stumbled at the end. (Conditionnel Passé)"
  ],
  [
    "nous aurions pu",
    "we would have been able to",
    "Nous aurions pu partir en vacances ensemble si nos dates avaient coïncidé.",
    "We would have been able to go on vacation together if our dates had matched. (Conditionnel Passé)"
  ],
  [
    "vous auriez pu",
    "you would have been able to (formal)",
    "Vous auriez pu terminer ce projet plus rapidement avec plus de ressources.",
    "You would have been able to finish this project more quickly with more resources. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient pu",
    "they would have been able to",
    "Ils auraient pu sauver leur relation s'ils avaient communiqué davantage.",
    "They would have been able to save their relationship if they had communicated more. (Conditionnel Passé)"
  ],
  [
    "peux",
    "can (imperative)",
    "Peux-tu me passer le sel, s'il te plaît?",
    "Can you pass me the salt, please? (L'impératif présent)"
  ],
  [
    "pouvons",
    "let's be able to (imperative)",
    "Pouvons-nous enfin discuter de ce projet important?",
    "Can we finally discuss this important project? (L'impératif présent)"
  ],
  [
    "pouvez",
    "be able to (imperative formal)",
    "Pouvez-vous me donner quelques minutes de votre temps?",
    "Can you give me a few minutes of your time? (L'impératif présent)"
  ],
  [
    "pouvant",
    "being able to",
    "En pouvant parler plusieurs langues, elle a trouvé un excellent travail.",
    "Being able to speak several languages, she found an excellent job. (Le participe présent)"
  ],
  [
    "pu",
    "been able to",
    "Il a pu finir son travail.",
    "He has been able to finish his work. (Le participe passé)"
  ],
  [
    "je viens",
    "I come",
    "Je viens de terminer mon livre préféré, c'était vraiment captivant!",
    "I just finished my favorite book, it was really captivating! (Présent)"
  ],
  [
    "tu viens",
    "you come (informal)",
    "Tu viens avec nous au concert ce soir? Ça va être génial!",
    "Are you coming with us to the concert tonight? It's going to be great! (Présent)"
  ],
  [
    "il/elle/on vient",
    "he/she comes",
    "Elle vient d'Italie et parle un français impeccable.",
    "She comes from Italy and speaks impeccable French. (Présent)"
  ],
  [
    "nous venons",
    "we come",
    "Nous venons de découvrir un nouveau restaurant dans le quartier.",
    "We just discovered a new restaurant in the neighborhood. (Présent)"
  ],
  [
    "vous venez",
    "you come (formal)",
    "Vous venez souvent dans cette librairie? Elle a une excellente sélection.",
    "Do you come to this bookstore often? It has an excellent selection. (Présent)"
  ],
  [
    "ils/elles viennent",
    "they come",
    "Ils viennent de gagner le championnat de football, quelle victoire!",
    "They just won the football championship, what a victory! (Présent)"
  ],
  [
    "je venais",
    "I was coming",
    "Je venais de finir mon repas quand le téléphone a sonné.",
    "I had just finished my meal when the phone rang. (Imparfait)"
  ],
  [
    "tu venais",
    "you were coming (informal)",
    "Tu venais de commencer à lire quand j'ai frappé à la porte.",
    "You had just started reading when I knocked on the door. (Imparfait)"
  ],
  [
    "il/elle/on venait",
    "he/she was coming",
    "Il venait de comprendre le problème quand la solution lui est apparue.",
    "He had just understood the problem when the solution appeared to him. (Imparfait)"
  ],
  [
    "nous venions",
    "we were coming",
    "Nous venions de quitter la maison quand il s'est mis à pleuvoir.",
    "We had just left the house when it started raining. (Imparfait)"
  ],
  [
    "vous veniez",
    "you were coming (formal)",
    "Vous veniez de terminer votre présentation quand les questions ont commencé.",
    "You had just finished your presentation when the questions began. (Imparfait)"
  ],
  [
    "ils/elles venaient",
    "they were coming",
    "Ils venaient de s'installer dans leur nouvel appartement quand les voisins sont arrivés.",
    "They had just settled into their new apartment when the neighbors arrived. (Imparfait)"
  ],
  [
    "je suis venu(e)",
    "I have come",
    "Je suis venu te surprendre pour ton anniversaire!",
    "I have come to surprise you for your birthday! (Passé Composé)"
  ],
  [
    "tu es venu(e)",
    "you have come (informal)",
    "Tu es venu juste à temps pour voir le coucher de soleil.",
    "You have come just in time to see the sunset. (Passé Composé)"
  ],
  [
    "il/elle/on est venu(e)",
    "he/she has come",
    "Il est venu de très loin pour assister à ce concert unique.",
    "He has come from very far away to attend this unique concert. (Passé Composé)"
  ],
  [
    "nous sommes venu(e)s",
    "we have come",
    "Nous sommes venus spécialement pour goûter votre cuisine réputée.",
    "We have come especially to taste your renowned cuisine. (Passé Composé)"
  ],
  [
    "vous êtes venu(e)s",
    "you have come (formal)",
    "Vous êtes venus de l'autre bout du pays pour cette occasion importante.",
    "You have come from the other end of the country for this important occasion. (Passé Composé)"
  ],
  [
    "ils/elles sont venu(e)s",
    "they have come",
    "Ils sont venus de plusieurs pays différents pour participer à cette conférence.",
    "They have come from several different countries to participate in this conference. (Passé Composé)"
  ],
  [
    "je viendrai",
    "I will come",
    "Je viendrai te chercher à la gare demain matin à huit heures.",
    "I will come pick you up at the station tomorrow morning at eight o'clock. (Futur Simple)"
  ],
  [
    "tu viendras",
    "you will come (informal)",
    "Tu viendras avec nous au festival de musique cet été, j'espère!",
    "You will come with us to the music festival this summer, I hope! (Futur Simple)"
  ],
  [
    "il/elle/on viendra",
    "he/she will come",
    "Il viendra nous rendre visite pendant les vacances de Noël.",
    "He will come visit us during the Christmas holidays. (Futur Simple)"
  ],
  [
    "nous viendrons",
    "we will come",
    "Nous viendrons en train pour éviter les embouteillages.",
    "We will come by train to avoid traffic jams. (Futur Simple)"
  ],
  [
    "vous viendrez",
    "you will come (formal)",
    "Vous viendrez assister à notre spectacle de fin d'année, n'est-ce pas?",
    "You will come attend our end-of-year show, won't you? (Futur Simple)"
  ],
  [
    "ils/elles viendront",
    "they will come",
    "Ils viendront de toute l'Europe pour célébrer ce moment historique.",
    "They will come from all over Europe to celebrate this historic moment. (Futur Simple)"
  ],
  [
    "j'étais venu(e)",
    "I had come",
    "J'étais venu t'aider à déménager, mais tu avais déjà tout terminé.",
    "I had come to help you move, but you had already finished everything. (Plus-Que-Parfait)"
  ],
  [
    "tu étais venu(e)",
    "you had come (informal)",
    "Tu étais venu spécialement pour me voir, c'était vraiment gentil de ta part.",
    "You had come especially to see me, that was really kind of you. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on était venu(e)",
    "he/she had come",
    "Il était venu de très loin pour assister à cette cérémonie importante.",
    "He had come from very far away to attend this important ceremony. (Plus-Que-Parfait)"
  ],
  [
    "nous étions venu(e)s",
    "we had come",
    "Nous étions venus pour te surprendre, mais tu n'étais pas là.",
    "We had come to surprise you, but you weren't there. (Plus-Que-Parfait)"
  ],
  [
    "vous étiez venu(e)s",
    "you had come (formal)",
    "Vous étiez venus de plusieurs pays pour participer à cette conférence.",
    "You had come from several countries to participate in this conference. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles étaient venu(e)s",
    "they had come",
    "Ils étaient venus pour célébrer avec nous, mais la fête avait été annulée.",
    "They had come to celebrate with us, but the party had been cancelled. (Plus-Que-Parfait)"
  ],
  [
    "je serai venu(e)",
    "I will have come",
    "D'ici la fin de la semaine, je serai venu te rendre visite trois fois.",
    "By the end of the week, I will have come to visit you three times. (Futur Antérieur)"
  ],
  [
    "tu seras venu(e)",
    "you will have come (informal)",
    "Tu seras venu plusieurs fois avant de comprendre comment ça fonctionne.",
    "You will have come several times before understanding how it works. (Futur Antérieur)"
  ],
  [
    "il/elle/on sera venu(e)",
    "he/she will have come",
    "Il sera venu de l'autre bout du monde pour assister à cet événement unique.",
    "He will have come from the other end of the world to attend this unique event. (Futur Antérieur)"
  ],
  [
    "nous serons venu(e)s",
    "we will have come",
    "Nous serons venus de plusieurs villes différentes pour cette réunion importante.",
    "We will have come from several different cities for this important meeting. (Futur Antérieur)"
  ],
  [
    "vous serez venu(e)s",
    "you will have come (formal)",
    "Vous serez venus de très loin pour participer à cette célébration.",
    "You will have come from very far away to participate in this celebration. (Futur Antérieur)"
  ],
  [
    "ils/elles seront venu(e)s",
    "they will have come",
    "Ils seront venus de tous les continents pour ce rassemblement historique.",
    "They will have come from all continents for this historic gathering. (Futur Antérieur)"
  ],
  [
    "je viendrais",
    "I would come",
    "Je viendrais volontiers à ta fête d'anniversaire si je n'avais pas déjà un autre engagement.",
    "I would gladly come to your birthday party if I didn't already have another commitment. (Conditionnel Présent)"
  ],
  [
    "tu viendrais",
    "you would come (informal)",
    "Tu viendrais avec nous au cinéma ce soir si tu n'étais pas si fatigué?",
    "Would you come with us to the movies tonight if you weren't so tired? (Conditionnel Présent)"
  ],
  [
    "il/elle/on viendrait",
    "he/she would come",
    "Elle viendrait nous aider si elle avait plus de temps libre.",
    "She would come help us if she had more free time. (Conditionnel Présent)"
  ],
  [
    "nous viendrions",
    "we would come",
    "Nous viendrions en train si les billets n'étaient pas si chers.",
    "We would come by train if the tickets weren't so expensive. (Conditionnel Présent)"
  ],
  [
    "vous viendriez",
    "you would come (formal)",
    "Vous viendriez assister à notre conférence si votre emploi du temps le permettait.",
    "You would come attend our conference if your schedule allowed it. (Conditionnel Présent)"
  ],
  [
    "ils/elles viendraient",
    "they would come",
    "Ils viendraient de plus loin si les moyens de transport étaient meilleurs.",
    "They would come from further away if the means of transportation were better. (Conditionnel Présent)"
  ],
  [
    "je serais venu(e)",
    "I would have come",
    "Je serais venu t'aider à déménager si tu m'avais prévenu plus tôt.",
    "I would have come to help you move if you had told me earlier. (Conditionnel Passé)"
  ],
  [
    "tu serais venu(e)",
    "you would have come (informal)",
    "Tu serais venu à la fête si tu n'avais pas été malade ce week-end.",
    "You would have come to the party if you hadn't been sick this weekend. (Conditionnel Passé)"
  ],
  [
    "il/elle/on serait venu(e)",
    "he/she would have come",
    "Il serait venu nous rendre visite s'il avait eu les moyens de voyager.",
    "He would have come to visit us if he had had the means to travel. (Conditionnel Passé)"
  ],
  [
    "nous serions venu(e)s",
    "we would have come",
    "Nous serions venus te surprendre si nous avions su que tu étais là.",
    "We would have come to surprise you if we had known you were there. (Conditionnel Passé)"
  ],
  [
    "vous seriez venu(e)s",
    "you would have come (formal)",
    "Vous seriez venus assister à notre spectacle si vous aviez reçu l'invitation à temps.",
    "You would have come to attend our show if you had received the invitation on time. (Conditionnel Passé)"
  ],
  [
    "ils/elles seraient venu(e)s",
    "they would have come",
    "Ils seraient venus de très loin pour cette occasion si les circonstances l'avaient permis.",
    "They would have come from very far away for this occasion if circumstances had allowed it. (Conditionnel Passé)"
  ],
  [
    "viens",
    "come (imperative)",
    "Viens voir cette vue magnifique depuis la terrasse!",
    "Come see this magnificent view from the terrace! (L'impératif présent)"
  ],
  [
    "venons",
    "let's come (imperative)",
    "Venons ensemble pour soutenir notre équipe lors du match final!",
    "Let's come together to support our team during the final match! (L'impératif présent)"
  ],
  [
    "venez",
    "come (imperative formal)",
    "Venez découvrir notre nouvelle collection d'art contemporain!",
    "Come discover our new collection of contemporary art! (L'impératif présent)"
  ],
  [
    "venant",
    "coming",
    "En venant de la gare, j'ai rencontré un vieil ami que je n'avais pas vu depuis des années.",
    "Coming from the station, I met an old friend I hadn't seen in years. (Le participe présent)"
  ],
  [
    "venu(e)",
    "come",
    "Il est venu de la campagne.",
    "He has come from the countryside. (Le participe passé)"
  ],
  [
    "je dois",
    "I must/have to",
    "Je dois absolument finir ce projet avant la fin de la semaine, sinon je serai en retard.",
    "I absolutely must finish this project before the end of the week, otherwise I'll be late. (Présent)"
  ],
  [
    "tu dois",
    "you must/have to (informal)",
    "Tu dois vraiment voir ce nouveau film, il est vraiment excellent!",
    "You really must see this new movie, it's really excellent! (Présent)"
  ],
  [
    "il/elle/on doit",
    "he/she must/has to",
    "Elle doit prendre une décision importante concernant son avenir professionnel.",
    "She must make an important decision regarding her professional future. (Présent)"
  ],
  [
    "nous devons",
    "we must/have to",
    "Nous devons absolument partir avant que la tempête n'arrive.",
    "We absolutely must leave before the storm arrives. (Présent)"
  ],
  [
    "vous devez",
    "you must/have to (formal)",
    "Vous devez remplir ce formulaire avant de pouvoir continuer.",
    "You must fill out this form before you can continue. (Présent)"
  ],
  [
    "ils/elles doivent",
    "they must/have to",
    "Ils doivent choisir entre plusieurs options intéressantes pour leur prochain voyage.",
    "They must choose between several interesting options for their next trip. (Présent)"
  ],
  [
    "je devais",
    "I had to/was supposed to",
    "Je devais rendre visite à ma grand-mère tous les dimanches quand j'étais enfant.",
    "I was supposed to visit my grandmother every Sunday when I was a child. (Imparfait)"
  ],
  [
    "tu devais",
    "you had to/were supposed to (informal)",
    "Tu devais toujours ranger ta chambre avant de sortir jouer.",
    "You always had to tidy your room before going out to play. (Imparfait)"
  ],
  [
    "il/elle/on devait",
    "he/she had to/was supposed to",
    "Il devait pratiquer le piano au moins une heure par jour pour progresser.",
    "He was supposed to practice the piano at least an hour a day to improve. (Imparfait)"
  ],
  [
    "nous devions",
    "we had to/were supposed to",
    "Nous devions nous lever très tôt chaque matin pour aller à l'école.",
    "We had to get up very early every morning to go to school. (Imparfait)"
  ],
  [
    "vous deviez",
    "you had to/were supposed to (formal)",
    "Vous deviez respecter un horaire strict pendant votre formation professionnelle.",
    "You had to follow a strict schedule during your professional training. (Imparfait)"
  ],
  [
    "ils/elles devaient",
    "they had to/were supposed to",
    "Ils devaient finir leurs devoirs avant de pouvoir regarder la télévision.",
    "They had to finish their homework before they could watch television. (Imparfait)"
  ],
  [
    "j'ai dû",
    "I have had to",
    "J'ai dû annuler mon voyage à cause d'une urgence familiale imprévue.",
    "I have had to cancel my trip because of an unexpected family emergency. (Passé Composé)"
  ],
  [
    "tu as dû",
    "you have had to (informal)",
    "Tu as dû travailler très dur pour réussir cet examen difficile.",
    "You have had to work very hard to pass this difficult exam. (Passé Composé)"
  ],
  [
    "il/elle/on a dû",
    "he/she has had to",
    "Elle a dû changer complètement ses plans à la dernière minute.",
    "She has had to completely change her plans at the last minute. (Passé Composé)"
  ],
  [
    "nous avons dû",
    "we have had to",
    "Nous avons dû attendre plus de deux heures à cause du retard de l'avion.",
    "We have had to wait more than two hours because of the plane's delay. (Passé Composé)"
  ],
  [
    "vous avez dû",
    "you have had to (formal)",
    "Vous avez dû faire face à de nombreux défis pour arriver où vous êtes aujourd'hui.",
    "You have had to face many challenges to get where you are today. (Passé Composé)"
  ],
  [
    "ils/elles ont dû",
    "they have had to",
    "Ils ont dû recommencer leur projet depuis le début après avoir perdu tous leurs fichiers.",
    "They have had to restart their project from the beginning after losing all their files. (Passé Composé)"
  ],
  [
    "je devrai",
    "I will have to",
    "Je devrai prendre une décision importante concernant ma carrière dans les prochains mois.",
    "I will have to make an important decision regarding my career in the coming months. (Futur Simple)"
  ],
  [
    "tu devras",
    "you will have to (informal)",
    "Tu devras apprendre à conduire si tu veux être indépendant.",
    "You will have to learn to drive if you want to be independent. (Futur Simple)"
  ],
  [
    "il/elle/on devra",
    "he/she will have to",
    "Elle devra choisir entre plusieurs universités prestigieuses pour ses études.",
    "She will have to choose between several prestigious universities for her studies. (Futur Simple)"
  ],
  [
    "nous devrons",
    "we will have to",
    "Nous devrons économiser beaucoup d'argent si nous voulons acheter cette maison.",
    "We will have to save a lot of money if we want to buy this house. (Futur Simple)"
  ],
  [
    "vous devrez",
    "you will have to (formal)",
    "Vous devrez présenter votre projet devant le comité la semaine prochaine.",
    "You will have to present your project to the committee next week. (Futur Simple)"
  ],
  [
    "ils/elles devront",
    "they will have to",
    "Ils devront s'adapter rapidement à leur nouvel environnement de travail.",
    "They will have to adapt quickly to their new work environment. (Futur Simple)"
  ],
  [
    "j'avais dû",
    "I had had to",
    "J'avais dû annuler tous mes rendez-vous avant de découvrir que c'était une fausse alerte.",
    "I had had to cancel all my appointments before discovering it was a false alarm. (Plus-Que-Parfait)"
  ],
  [
    "tu avais dû",
    "you had had to (informal)",
    "Tu avais dû travailler toute la nuit pour finir ce projet à temps.",
    "You had had to work all night to finish this project on time. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait dû",
    "he/she had had to",
    "Il avait dû changer complètement sa stratégie après avoir appris cette nouvelle information.",
    "He had had to completely change his strategy after learning this new information. (Plus-Que-Parfait)"
  ],
  [
    "nous avions dû",
    "we had had to",
    "Nous avions dû attendre plusieurs heures avant que le problème ne soit résolu.",
    "We had had to wait several hours before the problem was resolved. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez dû",
    "you had had to (formal)",
    "Vous aviez dû faire face à de nombreuses difficultés avant d'atteindre ce niveau de réussite.",
    "You had had to face many difficulties before reaching this level of success. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient dû",
    "they had had to",
    "Ils avaient dû recommencer leur travail depuis le début après avoir perdu toutes leurs données.",
    "They had had to restart their work from the beginning after losing all their data. (Plus-Que-Parfait)"
  ],
  [
    "j'aurais dû",
    "I should have had to",
    "J'aurais dû écouter mes parents quand ils me conseillaient d'étudier davantage.",
    "I should have listened to my parents when they advised me to study more. (Conditionnel Passé)"
  ],
  [
    "tu aurais dû",
    "you should have had to (informal)",
    "Tu aurais dû vérifier les horaires avant de partir, tu aurais évité ce retard.",
    "You should have checked the schedule before leaving, you would have avoided this delay. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait dû",
    "he/she should have had to",
    "Elle aurait dû prendre plus de temps pour réfléchir avant de prendre cette décision importante.",
    "She should have taken more time to think before making this important decision. (Conditionnel Passé)"
  ],
  [
    "nous aurions dû",
    "we should have had to",
    "Nous aurions dû partir plus tôt pour éviter les embouteillages du matin.",
    "We should have left earlier to avoid the morning traffic jams. (Conditionnel Passé)"
  ],
  [
    "vous auriez dû",
    "you should have had to (formal)",
    "Vous auriez dû consulter un spécialiste avant de prendre cette décision médicale.",
    "You should have consulted a specialist before making this medical decision. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient dû",
    "they should have had to",
    "Ils auraient dû économiser plus d'argent avant de partir en voyage autour du monde.",
    "They should have saved more money before leaving on a trip around the world. (Conditionnel Passé)"
  ],
  [
    "devant",
    "having to",
    "En devant partir tôt le matin, elle a manqué le petit-déjeuner avec ses amis.",
    "Having to leave early in the morning, she missed breakfast with her friends. (Le participe présent)"
  ],
  [
    "je fais",
    "I do/make",
    "Je fais de la randonnée tous les week-ends pour rester en forme et profiter de la nature.",
    "I go hiking every weekend to stay in shape and enjoy nature. (Présent)"
  ],
  [
    "tu fais",
    "you do/make (informal)",
    "Tu fais toujours de ton mieux, et c'est ce qui compte vraiment.",
    "You always do your best, and that's what really matters. (Présent)"
  ],
  [
    "il/elle/on fait",
    "he/she does/makes",
    "Elle fait de la poterie le soir pour se détendre après une longue journée de travail.",
    "She does pottery in the evening to relax after a long day of work. (Présent)"
  ],
  [
    "nous faisons",
    "we do/make",
    "Nous faisons un pique-nique dans le parc chaque dimanche quand il fait beau.",
    "We have a picnic in the park every Sunday when the weather is nice. (Présent)"
  ],
  [
    "vous faites",
    "you do/make (formal)",
    "Vous faites un excellent travail, continuez comme ça!",
    "You are doing excellent work, keep it up! (Présent)"
  ],
  [
    "ils/elles font",
    "they do/make",
    "Ils font du bénévolat dans une association caritative pour aider les personnes dans le besoin.",
    "They do volunteer work in a charity organization to help people in need. (Présent)"
  ],
  [
    "je faisais",
    "I was doing/making",
    "Je faisais du vélo dans le parc quand j'ai rencontré mon ancien professeur.",
    "I was cycling in the park when I met my old teacher. (Imparfait)"
  ],
  [
    "tu faisais",
    "you were doing/making (informal)",
    "Tu faisais de la pâtisserie avec ta grand-mère tous les samedis matin.",
    "You were baking with your grandmother every Saturday morning. (Imparfait)"
  ],
  [
    "il/elle/on faisait",
    "he/she was doing/making",
    "Il faisait des recherches approfondies sur ce sujet fascinant.",
    "He was doing in-depth research on this fascinating subject. (Imparfait)"
  ],
  [
    "nous faisions",
    "we were doing/making",
    "Nous faisions une randonnée en montagne quand la pluie a commencé à tomber.",
    "We were hiking in the mountains when the rain started falling. (Imparfait)"
  ],
  [
    "vous faisiez",
    "you were doing/making (formal)",
    "Vous faisiez des progrès remarquables dans l'apprentissage de cette langue.",
    "You were making remarkable progress in learning this language. (Imparfait)"
  ],
  [
    "ils/elles faisaient",
    "they were doing/making",
    "Ils faisaient du théâtre amateur et adoraient chaque représentation.",
    "They were doing amateur theater and loved every performance. (Imparfait)"
  ],
  [
    "j'ai fait",
    "I have done/made",
    "J'ai fait un gâteau au chocolat pour l'anniversaire de ma sœur, elle l'a adoré!",
    "I made a chocolate cake for my sister's birthday, she loved it! (Passé Composé)"
  ],
  [
    "tu as fait",
    "you have done/made (informal)",
    "Tu as fait un excellent travail sur ce projet, félicitations!",
    "You have done excellent work on this project, congratulations! (Passé Composé)"
  ],
  [
    "il/elle/on a fait",
    "he/she has done/made",
    "Elle a fait une découverte importante qui pourrait changer notre compréhension de ce phénomène.",
    "She has made an important discovery that could change our understanding of this phenomenon. (Passé Composé)"
  ],
  [
    "nous avons fait",
    "we have done/made",
    "Nous avons fait un voyage inoubliable en Asie l'année dernière.",
    "We took an unforgettable trip to Asia last year. (Passé Composé)"
  ],
  [
    "vous avez fait",
    "you have done/made (formal)",
    "Vous avez fait preuve d'un courage remarquable dans cette situation difficile.",
    "You have shown remarkable courage in this difficult situation. (Passé Composé)"
  ],
  [
    "ils/elles ont fait",
    "they have done/made",
    "Ils ont fait une fête surprise pour leur ami qui ne s'y attendait absolument pas.",
    "They threw a surprise party for their friend who absolutely didn't expect it. (Passé Composé)"
  ],
  [
    "je ferai",
    "I will do/make",
    "Je ferai de mon mieux pour réussir cet examen important.",
    "I will do my best to pass this important exam. (Futur Simple)"
  ],
  [
    "tu feras",
    "you will do/make (informal)",
    "Tu feras une excellente impression lors de ton entretien d'embauche, j'en suis sûr!",
    "You will make an excellent impression during your job interview, I'm sure! (Futur Simple)"
  ],
  [
    "il/elle/on fera",
    "he/she will do/make",
    "Elle fera une présentation passionnante sur son sujet de recherche demain.",
    "She will give an exciting presentation on her research topic tomorrow. (Futur Simple)"
  ],
  [
    "nous ferons",
    "we will do/make",
    "Nous ferons un voyage en Italie cet été pour découvrir la culture et la cuisine.",
    "We will take a trip to Italy this summer to discover the culture and cuisine. (Futur Simple)"
  ],
  [
    "vous ferez",
    "you will do/make (formal)",
    "Vous ferez des progrès remarquables si vous continuez à pratiquer régulièrement.",
    "You will make remarkable progress if you continue to practice regularly. (Futur Simple)"
  ],
  [
    "ils/elles feront",
    "they will do/make",
    "Ils feront une fête pour célébrer leur diplôme à la fin de l'année.",
    "They will throw a party to celebrate their graduation at the end of the year. (Futur Simple)"
  ],
  [
    "j'avais fait",
    "I had done/made",
    "J'avais fait tous mes devoirs avant que mes amis n'arrivent pour jouer.",
    "I had done all my homework before my friends arrived to play. (Plus-Que-Parfait)"
  ],
  [
    "tu avais fait",
    "you had done/made (informal)",
    "Tu avais fait un gâteau magnifique avant que je n'arrive à la fête.",
    "You had made a beautiful cake before I arrived at the party. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait fait",
    "he/she had done/made",
    "Il avait fait des recherches approfondies avant de présenter son projet.",
    "He had done thorough research before presenting his project. (Plus-Que-Parfait)"
  ],
  [
    "nous avions fait",
    "we had done/made",
    "Nous avions fait tous les préparatifs nécessaires avant que les invités n'arrivent.",
    "We had made all the necessary preparations before the guests arrived. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez fait",
    "you had done/made (formal)",
    "Vous aviez fait un travail remarquable avant de prendre votre retraite.",
    "You had done remarkable work before retiring. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient fait",
    "they had done/made",
    "Ils avaient fait tous leurs bagages avant que le taxi n'arrive pour les emmener à l'aéroport.",
    "They had packed all their bags before the taxi arrived to take them to the airport. (Plus-Que-Parfait)"
  ],
  [
    "j'aurais fait",
    "I would have done/made",
    "J'aurais fait un gâteau si j'avais eu le temps et les ingrédients nécessaires.",
    "I would have made a cake if I had had the time and necessary ingredients. (Conditionnel Passé)"
  ],
  [
    "tu aurais fait",
    "you would have done/made (informal)",
    "Tu aurais fait un excellent travail si tu avais eu plus de temps pour le préparer.",
    "You would have done excellent work if you had had more time to prepare it. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait fait",
    "he/she would have done/made",
    "Elle aurait fait une découverte importante si elle avait continué ses recherches.",
    "She would have made an important discovery if she had continued her research. (Conditionnel Passé)"
  ],
  [
    "nous aurions fait",
    "we would have done/made",
    "Nous aurions fait un voyage ensemble si nos dates de vacances avaient coïncidé.",
    "We would have taken a trip together if our vacation dates had matched. (Conditionnel Passé)"
  ],
  [
    "vous auriez fait",
    "you would have done/made (formal)",
    "Vous auriez fait des progrès encore plus rapides si vous aviez pratiqué davantage.",
    "You would have made even faster progress if you had practiced more. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient fait",
    "they would have done/made",
    "Ils auraient fait une fête grandiose si le budget l'avait permis.",
    "They would have thrown a grand party if the budget had allowed it. (Conditionnel Passé)"
  ],
  [
    "faisant",
    "doing/making",
    "En faisant du bénévolat, j'ai rencontré des personnes formidables et j'ai appris beaucoup sur moi-même.",
    "While doing volunteer work, I met wonderful people and learned a lot about myself. (Le participe présent)"
  ],
  [
    "je prends",
    "I take",
    "Je prends toujours mon temps le matin pour savourer un bon café et lire les nouvelles.",
    "I always take my time in the morning to savor a good coffee and read the news. (Présent)"
  ],
  [
    "tu prends",
    "you take (informal)",
    "Tu prends des cours de guitare pour réaliser ton rêve de jouer dans un groupe.",
    "You take guitar lessons to fulfill your dream of playing in a band. (Présent)"
  ],
  [
    "il/elle/on prend",
    "he/she takes",
    "Elle prend des notes soigneusement pendant chaque cours pour bien réviser plus tard.",
    "She takes notes carefully during each class to review well later. (Présent)"
  ],
  [
    "nous prenons",
    "we take",
    "Nous prenons le train tous les jours pour aller travailler en ville.",
    "We take the train every day to go to work in the city. (Présent)"
  ],
  [
    "vous prenez",
    "you take (formal)",
    "Vous prenez des décisions importantes avec beaucoup de réflexion et de sagesse.",
    "You make important decisions with much thought and wisdom. (Présent)"
  ],
  [
    "ils/elles prennent",
    "they take",
    "Ils prennent des photos magnifiques lors de leurs voyages à travers le monde.",
    "They take beautiful photos during their travels around the world. (Présent)"
  ],
  [
    "je prenais",
    "I was taking",
    "Je prenais des cours de danse tous les samedis quand j'étais adolescent.",
    "I was taking dance classes every Saturday when I was a teenager. (Imparfait)"
  ],
  [
    "tu prenais",
    "you were taking (informal)",
    "Tu prenais toujours ton petit-déjeuner au lit le dimanche matin.",
    "You always used to have your breakfast in bed on Sunday mornings. (Imparfait)"
  ],
  [
    "il/elle/on prenait",
    "he/she was taking",
    "Il prenait des notes détaillées pendant chaque conférence pour ne rien oublier.",
    "He was taking detailed notes during each conference so as not to forget anything. (Imparfait)"
  ],
  [
    "nous prenions",
    "we were taking",
    "Nous prenions le même chemin tous les jours pour aller à l'école ensemble.",
    "We were taking the same route every day to go to school together. (Imparfait)"
  ],
  [
    "vous preniez",
    "you were taking (formal)",
    "Vous preniez des décisions importantes après avoir consulté tous les experts.",
    "You were making important decisions after consulting all the experts. (Imparfait)"
  ],
  [
    "ils/elles prenaient",
    "they were taking",
    "Ils prenaient des photos de tous les moments importants de leur vie.",
    "They were taking photos of all the important moments of their life. (Imparfait)"
  ],
  [
    "j'ai pris",
    "I have taken",
    "J'ai pris une décision importante qui va changer ma vie professionnelle.",
    "I have made an important decision that will change my professional life. (Passé Composé)"
  ],
  [
    "tu as pris",
    "you have taken (informal)",
    "Tu as pris de magnifiques photos lors de ton voyage en Grèce.",
    "You took beautiful photos during your trip to Greece. (Passé Composé)"
  ],
  [
    "il/elle/on a pris",
    "he/she has taken",
    "Elle a pris des cours de cuisine italienne et maintenant elle cuisine divinement bien.",
    "She took Italian cooking classes and now she cooks divinely well. (Passé Composé)"
  ],
  [
    "nous avons pris",
    "we have taken",
    "Nous avons pris le temps de visiter tous les musées de cette ville fascinante.",
    "We took the time to visit all the museums in this fascinating city. (Passé Composé)"
  ],
  [
    "vous avez pris",
    "you have taken (formal)",
    "Vous avez pris une initiative remarquable qui a inspiré toute l'équipe.",
    "You took a remarkable initiative that inspired the entire team. (Passé Composé)"
  ],
  [
    "ils/elles ont pris",
    "they have taken",
    "Ils ont pris des risques calculés et ont réussi à créer leur propre entreprise.",
    "They took calculated risks and succeeded in creating their own business. (Passé Composé)"
  ],
  [
    "je prendrai",
    "I will take",
    "Je prendrai des cours de photographie pour améliorer mes compétences artistiques.",
    "I will take photography classes to improve my artistic skills. (Futur Simple)"
  ],
  [
    "tu prendras",
    "you will take (informal)",
    "Tu prendras le temps de réfléchir avant de prendre cette décision importante.",
    "You will take the time to think before making this important decision. (Futur Simple)"
  ],
  [
    "il/elle/on prendra",
    "he/she will take",
    "Elle prendra des notes détaillées pendant la conférence pour ne rien manquer.",
    "She will take detailed notes during the conference so as not to miss anything. (Futur Simple)"
  ],
  [
    "nous prendrons",
    "we will take",
    "Nous prendrons le train de nuit pour arriver tôt le lendemain matin.",
    "We will take the night train to arrive early the next morning. (Futur Simple)"
  ],
  [
    "vous prendrez",
    "you will take (formal)",
    "Vous prendrez des mesures importantes pour améliorer la situation de l'entreprise.",
    "You will take important measures to improve the company's situation. (Futur Simple)"
  ],
  [
    "ils/elles prendront",
    "they will take",
    "Ils prendront des photos souvenirs de leur voyage de noces en Italie.",
    "They will take souvenir photos of their honeymoon trip to Italy. (Futur Simple)"
  ],
  [
    "j'avais pris",
    "I had taken",
    "J'avais pris toutes les précautions nécessaires avant que la tempête n'arrive.",
    "I had taken all the necessary precautions before the storm arrived. (Plus-Que-Parfait)"
  ],
  [
    "tu avais pris",
    "you had taken (informal)",
    "Tu avais pris des notes complètes avant que le professeur ne commence son cours.",
    "You had taken complete notes before the teacher started his class. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait pris",
    "he/she had taken",
    "Il avait pris une décision importante avant que la situation ne devienne critique.",
    "He had made an important decision before the situation became critical. (Plus-Que-Parfait)"
  ],
  [
    "nous avions pris",
    "we had taken",
    "Nous avions pris le temps de bien préparer notre présentation avant la réunion.",
    "We had taken the time to properly prepare our presentation before the meeting. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez pris",
    "you had taken (formal)",
    "Vous aviez pris des mesures préventives avant que le problème ne s'aggrave.",
    "You had taken preventive measures before the problem worsened. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient pris",
    "they had taken",
    "Ils avaient pris des photos de tous les monuments avant que la pluie ne commence.",
    "They had taken photos of all the monuments before the rain started. (Plus-Que-Parfait)"
  ],
  [
    "j'aurais pris",
    "I would have taken",
    "J'aurais pris des cours de langue si j'avais eu plus de temps libre.",
    "I would have taken language classes if I had had more free time. (Conditionnel Passé)"
  ],
  [
    "tu aurais pris",
    "you would have taken (informal)",
    "Tu aurais pris de meilleures photos si tu avais eu un appareil plus performant.",
    "You would have taken better photos if you had had a more powerful camera. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait pris",
    "he/she would have taken",
    "Elle aurait pris une décision différente si elle avait eu toutes les informations.",
    "She would have made a different decision if she had had all the information. (Conditionnel Passé)"
  ],
  [
    "nous aurions pris",
    "we would have taken",
    "Nous aurions pris le train si les billets n'avaient pas été si chers.",
    "We would have taken the train if the tickets hadn't been so expensive. (Conditionnel Passé)"
  ],
  [
    "vous auriez pris",
    "you would have taken (formal)",
    "Vous auriez pris des mesures plus strictes si vous aviez su l'ampleur du problème.",
    "You would have taken stricter measures if you had known the extent of the problem. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient pris",
    "they would have taken",
    "Ils auraient pris plus de risques si les circonstances avaient été différentes.",
    "They would have taken more risks if the circumstances had been different. (Conditionnel Passé)"
  ],
  [
    "prenant",
    "taking",
    "En prenant des cours de danse, j'ai découvert une nouvelle passion et rencontré des amis formidables.",
    "By taking dance classes, I discovered a new passion and met wonderful friends. (Le participe présent)"
  ],
  [
    "je sais",
    "I know",
    "Je sais que tu vas réussir cet examen, tu as travaillé si dur!",
    "I know you're going to pass this exam, you've worked so hard! (Présent)"
  ],
  [
    "tu sais",
    "you know (informal)",
    "Tu sais jouer de la guitare? C'est vraiment impressionnant!",
    "You know how to play the guitar? That's really impressive! (Présent)"
  ],
  [
    "il/elle/on sait",
    "he/she knows",
    "Elle sait parler cinq langues couramment, c'est un vrai talent!",
    "She knows how to speak five languages fluently, that's a real talent! (Présent)"
  ],
  [
    "nous savons",
    "we know",
    "Nous savons que ce sera difficile, mais nous allons y arriver ensemble.",
    "We know it will be difficult, but we're going to make it together. (Présent)"
  ],
  [
    "vous savez",
    "you know (formal)",
    "Vous savez comment résoudre ce problème complexe grâce à votre expérience.",
    "You know how to solve this complex problem thanks to your experience. (Présent)"
  ],
  [
    "ils/elles savent",
    "they know",
    "Ils savent exactement ce qu'ils veulent faire dans la vie, c'est admirable.",
    "They know exactly what they want to do in life, that's admirable. (Présent)"
  ],
  [
    "je savais",
    "I knew",
    "Je savais que cette décision allait changer ma vie, mais je l'ai prise quand même.",
    "I knew this decision would change my life, but I made it anyway. (Imparfait)"
  ],
  [
    "tu savais",
    "you knew (informal)",
    "Tu savais déjà jouer du piano à l'âge de cinq ans, c'était incroyable!",
    "You already knew how to play the piano at the age of five, it was incredible! (Imparfait)"
  ],
  [
    "il/elle/on savait",
    "he/she knew",
    "Il savait que ce serait difficile, mais il a persévéré et a réussi.",
    "He knew it would be difficult, but he persevered and succeeded. (Imparfait)"
  ],
  [
    "nous savions",
    "we knew",
    "Nous savions que ce voyage serait une aventure inoubliable, et nous avions raison.",
    "We knew this trip would be an unforgettable adventure, and we were right. (Imparfait)"
  ],
  [
    "vous saviez",
    "you knew (formal)",
    "Vous saviez exactement comment gérer cette situation délicate grâce à votre expertise.",
    "You knew exactly how to handle this delicate situation thanks to your expertise. (Imparfait)"
  ],
  [
    "ils/elles savaient",
    "they knew",
    "Ils savaient que leur amitié durerait toute la vie, et ils avaient raison.",
    "They knew their friendship would last a lifetime, and they were right. (Imparfait)"
  ],
  [
    "j'ai su",
    "I have known",
    "J'ai su immédiatement que cette personne serait importante dans ma vie.",
    "I have known immediately that this person would be important in my life. (Passé Composé)"
  ],
  [
    "tu as su",
    "you have known (informal)",
    "Tu as su garder ton calme dans cette situation stressante, bravo!",
    "You have known how to keep your cool in this stressful situation, well done! (Passé Composé)"
  ],
  [
    "il/elle/on a su",
    "he/she has known",
    "Elle a su trouver la solution à ce problème complexe en quelques minutes.",
    "She has known how to find the solution to this complex problem in a few minutes. (Passé Composé)"
  ],
  [
    "nous avons su",
    "we have known",
    "Nous avons su adapter notre stratégie face aux difficultés rencontrées.",
    "We have known how to adapt our strategy in the face of the difficulties encountered. (Passé Composé)"
  ],
  [
    "vous avez su",
    "you have known (formal)",
    "Vous avez su inspirer toute l'équipe avec votre leadership exceptionnel.",
    "You have known how to inspire the entire team with your exceptional leadership. (Passé Composé)"
  ],
  [
    "ils/elles ont su",
    "they have known",
    "Ils ont su créer une entreprise prospère à partir de presque rien.",
    "They have known how to create a successful business from almost nothing. (Passé Composé)"
  ],
  [
    "je saurai",
    "I will know",
    "Je saurai bientôt si j'ai été accepté dans cette université prestigieuse.",
    "I will soon know if I have been accepted into this prestigious university. (Futur Simple)"
  ],
  [
    "tu sauras",
    "you will know (informal)",
    "Tu sauras comment résoudre ce problème après avoir suivi ce cours.",
    "You will know how to solve this problem after taking this course. (Futur Simple)"
  ],
  [
    "il/elle/on saura",
    "he/she will know",
    "Elle saura parler couramment le français dans quelques mois si elle continue à pratiquer.",
    "She will know how to speak French fluently in a few months if she continues to practice. (Futur Simple)"
  ],
  [
    "nous saurons",
    "we will know",
    "Nous saurons demain si notre projet a été approuvé par le comité.",
    "We will know tomorrow if our project has been approved by the committee. (Futur Simple)"
  ],
  [
    "vous saurez",
    "you will know (formal)",
    "Vous saurez comment gérer cette situation complexe grâce à votre formation approfondie.",
    "You will know how to handle this complex situation thanks to your thorough training. (Futur Simple)"
  ],
  [
    "ils/elles sauront",
    "they will know",
    "Ils sauront exactement quoi faire quand ils auront terminé leur formation.",
    "They will know exactly what to do when they have finished their training. (Futur Simple)"
  ],
  [
    "j'avais su",
    "I had known",
    "J'avais su que cette décision serait importante avant même de la prendre.",
    "I had known that this decision would be important even before making it. (Plus-Que-Parfait)"
  ],
  [
    "tu avais su",
    "you had known (informal)",
    "Tu avais su comment réagir dans cette situation avant que je ne t'explique quoi faire.",
    "You had known how to react in this situation before I explained what to do. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait su",
    "he/she had known",
    "Il avait su que ce projet serait un succès bien avant que les résultats ne le confirment.",
    "He had known that this project would be a success long before the results confirmed it. (Plus-Que-Parfait)"
  ],
  [
    "nous avions su",
    "we had known",
    "Nous avions su comment résoudre ce problème avant que la situation ne devienne critique.",
    "We had known how to solve this problem before the situation became critical. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez su",
    "you had known (formal)",
    "Vous aviez su gérer cette crise avec compétence avant même que les experts n'arrivent.",
    "You had known how to handle this crisis competently before the experts even arrived. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient su",
    "they had known",
    "Ils avaient su que leur amitié durerait toute la vie depuis leur première rencontre.",
    "They had known that their friendship would last a lifetime since their first meeting. (Plus-Que-Parfait)"
  ],
  [
    "j'aurais su",
    "I would have known",
    "J'aurais su comment réagir si tu m'avais prévenu de cette situation à l'avance.",
    "I would have known how to react if you had warned me about this situation in advance. (Conditionnel Passé)"
  ],
  [
    "tu aurais su",
    "you would have known (informal)",
    "Tu aurais su résoudre ce problème si tu avais eu plus d'expérience dans ce domaine.",
    "You would have known how to solve this problem if you had had more experience in this field. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait su",
    "he/she would have known",
    "Elle aurait su comment gérer cette crise si elle avait reçu la formation appropriée.",
    "She would have known how to handle this crisis if she had received the appropriate training. (Conditionnel Passé)"
  ],
  [
    "nous aurions su",
    "we would have known",
    "Nous aurions su quoi faire si nous avions eu toutes les informations nécessaires.",
    "We would have known what to do if we had had all the necessary information. (Conditionnel Passé)"
  ],
  [
    "vous auriez su",
    "you would have known (formal)",
    "Vous auriez su comment résoudre ce conflit si vous aviez été présent lors de la réunion.",
    "You would have known how to resolve this conflict if you had been present at the meeting. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient su",
    "they would have known",
    "Ils auraient su comment éviter cette erreur s'ils avaient consulté un expert au préalable.",
    "They would have known how to avoid this mistake if they had consulted an expert beforehand. (Conditionnel Passé)"
  ],
  [
    "sachant",
    "knowing",
    "En sachant que le temps était limité, elle a travaillé avec une efficacité remarquable.",
    "Knowing that time was limited, she worked with remarkable efficiency. (Le participe présent)"
  ],
  [
    "je dis",
    "I say/tell",
    "Je dis toujours la vérité, même quand c'est difficile.",
    "I always tell the truth, even when it's difficult. (Présent)"
  ],
  [
    "tu dis",
    "you say/tell (informal)",
    "Tu dis que tu veux apprendre le français, mais tu ne pratiques jamais!",
    "You say you want to learn French, but you never practice! (Présent)"
  ],
  [
    "il/elle/on dit",
    "he/she says/tells",
    "Elle dit qu'elle va venir à la fête, mais je ne suis pas sûr qu'elle le fasse vraiment.",
    "She says she's going to come to the party, but I'm not sure she'll really do it. (Présent)"
  ],
  [
    "nous disons",
    "we say/tell",
    "Nous disons souvent que nous allons voyager, mais nous ne le faisons jamais.",
    "We often say we're going to travel, but we never do it. (Présent)"
  ],
  [
    "vous dites",
    "you say/tell (formal)",
    "Vous dites que ce projet est important, et je suis tout à fait d'accord avec vous.",
    "You say this project is important, and I completely agree with you. (Présent)"
  ],
  [
    "ils/elles disent",
    "they say/tell",
    "Ils disent qu'ils vont déménager dans une autre ville l'année prochaine.",
    "They say they're going to move to another city next year. (Présent)"
  ],
  [
    "je disais",
    "I was saying/telling",
    "Je disais toujours à mes enfants qu'ils pouvaient réaliser leurs rêves s'ils travaillaient dur.",
    "I always used to tell my children that they could achieve their dreams if they worked hard. (Imparfait)"
  ],
  [
    "tu disais",
    "you were saying/telling (informal)",
    "Tu disais que tu voulais devenir médecin quand tu étais enfant, tu te souviens?",
    "You used to say you wanted to become a doctor when you were a child, do you remember? (Imparfait)"
  ],
  [
    "il/elle/on disait",
    "he/she was saying/telling",
    "Il disait toujours des blagues pour faire rire tout le monde.",
    "He always used to tell jokes to make everyone laugh. (Imparfait)"
  ],
  [
    "nous disions",
    "we were saying/telling",
    "Nous disions souvent que nous allions visiter le Japon un jour, et finalement nous l'avons fait!",
    "We often used to say we were going to visit Japan one day, and finally we did it! (Imparfait)"
  ],
  [
    "vous disiez",
    "you were saying/telling (formal)",
    "Vous disiez toujours que la patience était une vertu importante dans la vie.",
    "You always used to say that patience was an important virtue in life. (Imparfait)"
  ],
  [
    "ils/elles disaient",
    "they were saying/telling",
    "Ils disaient qu'ils allaient se marier un jour, et maintenant c'est fait!",
    "They used to say they were going to get married one day, and now it's done! (Imparfait)"
  ],
  [
    "j'ai dit",
    "I have said/told",
    "J'ai dit à mon meilleur ami que j'étais fier de lui et de ses accomplissements.",
    "I have told my best friend that I was proud of him and his accomplishments. (Passé Composé)"
  ],
  [
    "tu as dit",
    "you have said/told (informal)",
    "Tu as dit quelque chose de très intelligent pendant la réunion, tout le monde était impressionné.",
    "You said something very intelligent during the meeting, everyone was impressed. (Passé Composé)"
  ],
  [
    "il/elle/on a dit",
    "he/she has said/told",
    "Elle a dit qu'elle allait déménager à Paris pour poursuivre ses études.",
    "She said she was going to move to Paris to continue her studies. (Passé Composé)"
  ],
  [
    "nous avons dit",
    "we have said/told",
    "Nous avons dit à nos parents que nous allions nous marier, et ils étaient si heureux!",
    "We told our parents that we were going to get married, and they were so happy! (Passé Composé)"
  ],
  [
    "vous avez dit",
    "you have said/told (formal)",
    "Vous avez dit des paroles très réconfortantes qui m'ont beaucoup aidé dans cette période difficile.",
    "You said very comforting words that helped me a lot during this difficult period. (Passé Composé)"
  ],
  [
    "ils/elles ont dit",
    "they have said/told",
    "Ils ont dit qu'ils allaient créer leur propre entreprise ensemble, et c'est exactement ce qu'ils ont fait!",
    "They said they were going to create their own business together, and that's exactly what they did! (Passé Composé)"
  ],
  [
    "je dirai",
    "I will say/tell",
    "Je dirai à mes enfants que je suis fier d'eux quand ils recevront leur diplôme.",
    "I will tell my children that I am proud of them when they receive their diploma. (Futur Simple)"
  ],
  [
    "tu diras",
    "you will say/tell (informal)",
    "Tu diras à ta mère que je l'appelle demain pour prendre de ses nouvelles.",
    "You will tell your mother that I'm calling her tomorrow to see how she's doing. (Futur Simple)"
  ],
  [
    "il/elle/on dira",
    "he/she will say/tell",
    "Elle dira à son patron qu'elle a besoin de vacances pour se reposer un peu.",
    "She will tell her boss that she needs a vacation to rest a bit. (Futur Simple)"
  ],
  [
    "nous dirons",
    "we will say/tell",
    "Nous dirons à nos amis que nous organisons une fête surprise pour leur anniversaire.",
    "We will tell our friends that we're organizing a surprise party for their birthday. (Futur Simple)"
  ],
  [
    "vous direz",
    "you will say/tell (formal)",
    "Vous direz à votre équipe que leur travail exceptionnel a été remarqué et apprécié.",
    "You will tell your team that their exceptional work has been noticed and appreciated. (Futur Simple)"
  ],
  [
    "ils/elles diront",
    "they will say/tell",
    "Ils diront à leurs parents qu'ils ont décidé de partir vivre à l'étranger pendant un an.",
    "They will tell their parents that they have decided to go live abroad for a year. (Futur Simple)"
  ],
  [
    "j'avais dit",
    "I had said/told",
    "J'avais dit à mes amis que je viendrais à leur fête avant qu'ils ne m'invitent officiellement.",
    "I had told my friends that I would come to their party before they officially invited me. (Plus-Que-Parfait)"
  ],
  [
    "tu avais dit",
    "you had said/told (informal)",
    "Tu avais dit que tu allais m'aider avec ce projet avant que je ne te le demande.",
    "You had said that you were going to help me with this project before I asked you. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait dit",
    "he/she had said/told",
    "Il avait dit qu'il viendrait nous rendre visite avant que nous ne déménagions.",
    "He had said that he would come visit us before we moved. (Plus-Que-Parfait)"
  ],
  [
    "nous avions dit",
    "we had said/told",
    "Nous avions dit à nos parents que nous allions nous marier avant qu'ils ne le découvrent par hasard.",
    "We had told our parents that we were going to get married before they found out by chance. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez dit",
    "you had said/told (formal)",
    "Vous aviez dit que vous prendriez votre retraite l'année prochaine avant que l'annonce officielle ne soit faite.",
    "You had said that you would retire next year before the official announcement was made. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient dit",
    "they had said/told",
    "Ils avaient dit qu'ils allaient créer leur entreprise avant que les investisseurs ne soient contactés.",
    "They had said they were going to create their business before the investors were contacted. (Plus-Que-Parfait)"
  ],
  [
    "j'aurais dit",
    "I would have said/told",
    "J'aurais dit la vérité si j'avais su que c'était si important pour toi.",
    "I would have told the truth if I had known it was so important to you. (Conditionnel Passé)"
  ],
  [
    "tu aurais dit",
    "you would have said/told (informal)",
    "Tu aurais dit quelque chose de différent si tu avais eu toutes les informations.",
    "You would have said something different if you had had all the information. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait dit",
    "he/she would have said/told",
    "Elle aurait dit oui si elle avait su à quel point cette opportunité était rare.",
    "She would have said yes if she had known how rare this opportunity was. (Conditionnel Passé)"
  ],
  [
    "nous aurions dit",
    "we would have said/told",
    "Nous aurions dit à nos parents plus tôt si nous avions su qu'ils seraient si heureux.",
    "We would have told our parents earlier if we had known they would be so happy. (Conditionnel Passé)"
  ],
  [
    "vous auriez dit",
    "you would have said/told (formal)",
    "Vous auriez dit des paroles plus réconfortantes si vous aviez su l'ampleur de la situation.",
    "You would have said more comforting words if you had known the extent of the situation. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient dit",
    "they would have said/told",
    "Ils auraient dit qu'ils allaient déménager plus tôt si les circonstances l'avaient permis.",
    "They would have said they were going to move earlier if circumstances had allowed it. (Conditionnel Passé)"
  ],
  [
    "disant",
    "saying/telling",
    "En disant toujours la vérité, elle a gagné le respect et la confiance de tous ceux qui la connaissent.",
    "By always telling the truth, she has gained the respect and trust of everyone who knows her. (Le participe présent)"
  ],
  [
    "je lis",
    "I read",
    "Je lis au moins un livre par mois pour enrichir ma culture et élargir mes horizons.",
    "I read at least one book per month to enrich my culture and broaden my horizons. (Présent)"
  ],
  [
    "tu lis",
    "you read (informal)",
    "Tu lis toujours les critiques avant d'aller voir un film au cinéma, c'est une bonne habitude!",
    "You always read reviews before going to see a movie at the cinema, that's a good habit! (Présent)"
  ],
  [
    "il/elle/on lit",
    "he/she reads",
    "Elle lit des romans policiers passionnants le soir avant de s'endormir.",
    "She reads exciting detective novels in the evening before falling asleep. (Présent)"
  ],
  [
    "nous lisons",
    "we read",
    "Nous lisons ensemble des histoires à nos enfants chaque soir, c'est un moment précieux.",
    "We read stories together to our children every evening, it's a precious moment. (Présent)"
  ],
  [
    "vous lisez",
    "you read (formal)",
    "Vous lisez beaucoup de livres sur l'histoire et la philosophie, c'est très impressionnant.",
    "You read many books on history and philosophy, that's very impressive. (Présent)"
  ],
  [
    "ils/elles lisent",
    "they read",
    "Ils lisent des articles scientifiques pour rester à jour dans leur domaine de recherche.",
    "They read scientific articles to stay up to date in their field of research. (Présent)"
  ],
  [
    "je lisais",
    "I was reading",
    "Je lisais un roman captivant quand le téléphone a sonné et m'a interrompu.",
    "I was reading a captivating novel when the phone rang and interrupted me. (Imparfait)"
  ],
  [
    "tu lisais",
    "you were reading (informal)",
    "Tu lisais tranquillement dans le jardin quand il s'est mis à pleuvoir soudainement.",
    "You were reading quietly in the garden when it suddenly started raining. (Imparfait)"
  ],
  [
    "il/elle/on lisait",
    "he/she was reading",
    "Il lisait des articles sur l'astronomie avec passion quand sa sœur est entrée dans la pièce.",
    "He was reading articles on astronomy with passion when his sister entered the room. (Imparfait)"
  ],
  [
    "nous lisions",
    "we were reading",
    "Nous lisions des histoires à nos enfants quand ils se sont endormis dans nos bras.",
    "We were reading stories to our children when they fell asleep in our arms. (Imparfait)"
  ],
  [
    "vous lisiez",
    "you were reading (formal)",
    "Vous lisiez des poèmes classiques avec beaucoup d'émotion et de sensibilité.",
    "You were reading classical poems with much emotion and sensitivity. (Imparfait)"
  ],
  [
    "ils/elles lisaient",
    "they were reading",
    "Ils lisaient des journaux dans le café quand leurs amis sont arrivés pour les rejoindre.",
    "They were reading newspapers in the café when their friends arrived to join them. (Imparfait)"
  ],
  [
    "j'ai lu",
    "I have read",
    "J'ai lu ce roman en une seule journée tellement il était captivant et bien écrit.",
    "I read this novel in a single day, it was so captivating and well-written. (Passé Composé)"
  ],
  [
    "tu as lu",
    "you have read (informal)",
    "Tu as lu tous les articles sur ce sujet, tu es vraiment bien informé maintenant!",
    "You have read all the articles on this subject, you're really well informed now! (Passé Composé)"
  ],
  [
    "il/elle/on a lu",
    "he/she has read",
    "Elle a lu plus de cent livres cette année, c'est impressionnant!",
    "She has read more than a hundred books this year, that's impressive! (Passé Composé)"
  ],
  [
    "nous avons lu",
    "we have read",
    "Nous avons lu ce livre ensemble et nous avons adoré discuter de chaque chapitre.",
    "We read this book together and we loved discussing each chapter. (Passé Composé)"
  ],
  [
    "vous avez lu",
    "you have read (formal)",
    "Vous avez lu tous les grands classiques de la littérature française, quel accomplissement!",
    "You have read all the great classics of French literature, what an accomplishment! (Passé Composé)"
  ],
  [
    "ils/elles ont lu",
    "they have read",
    "Ils ont lu des articles fascinants sur les découvertes scientifiques récentes.",
    "They have read fascinating articles on recent scientific discoveries. (Passé Composé)"
  ],
  [
    "je lirai",
    "I will read",
    "Je lirai ce nouveau roman dès qu'il sortira en librairie, j'ai hâte de le découvrir!",
    "I will read this new novel as soon as it comes out in bookstores, I can't wait to discover it! (Futur Simple)"
  ],
  [
    "tu liras",
    "you will read (informal)",
    "Tu liras tous les articles sur ce sujet pour être bien préparé pour ton examen.",
    "You will read all the articles on this subject to be well prepared for your exam. (Futur Simple)"
  ],
  [
    "il/elle/on lira",
    "he/she will read",
    "Elle lira ce livre passionnant pendant ses vacances pour se détendre.",
    "She will read this exciting book during her vacation to relax. (Futur Simple)"
  ],
  [
    "nous lirons",
    "we will read",
    "Nous lirons ce roman ensemble et nous en discuterons chaque semaine.",
    "We will read this novel together and discuss it every week. (Futur Simple)"
  ],
  [
    "vous lirez",
    "you will read (formal)",
    "Vous lirez ces documents importants avant la réunion de demain matin.",
    "You will read these important documents before tomorrow morning's meeting. (Futur Simple)"
  ],
  [
    "ils/elles liront",
    "they will read",
    "Ils liront tous les livres recommandés par leur professeur pour approfondir leurs connaissances.",
    "They will read all the books recommended by their teacher to deepen their knowledge. (Futur Simple)"
  ],
  [
    "j'avais lu",
    "I had read",
    "J'avais lu ce livre plusieurs fois avant de le recommander à mes amis.",
    "I had read this book several times before recommending it to my friends. (Plus-Que-Parfait)"
  ],
  [
    "tu avais lu",
    "you had read (informal)",
    "Tu avais lu tous les articles sur ce sujet avant que le professeur ne commence son cours.",
    "You had read all the articles on this subject before the teacher started his class. (Plus-Que-Parfait)"
  ],
  [
    "il/elle/on avait lu",
    "he/she had read",
    "Il avait lu ce roman passionnant avant que le film ne sorte au cinéma.",
    "He had read this exciting novel before the movie came out in theaters. (Plus-Que-Parfait)"
  ],
  [
    "nous avions lu",
    "we had read",
    "Nous avions lu ce livre ensemble avant de décider de le relire cette année.",
    "We had read this book together before deciding to reread it this year. (Plus-Que-Parfait)"
  ],
  [
    "vous aviez lu",
    "you had read (formal)",
    "Vous aviez lu tous les documents nécessaires avant que la réunion ne commence.",
    "You had read all the necessary documents before the meeting started. (Plus-Que-Parfait)"
  ],
  [
    "ils/elles avaient lu",
    "they had read",
    "Ils avaient lu tous les livres recommandés avant de commencer leur thèse.",
    "They had read all the recommended books before starting their thesis. (Plus-Que-Parfait)"
  ],
  [
    "j'aurais lu",
    "I would have read",
    "J'aurais lu ce livre si j'avais eu plus de temps libre pendant mes vacances.",
    "I would have read this book if I had had more free time during my vacation. (Conditionnel Passé)"
  ],
  [
    "tu aurais lu",
    "you would have read (informal)",
    "Tu aurais lu tous ces articles si tu avais su qu'ils étaient si importants pour ton examen.",
    "You would have read all these articles if you had known they were so important for your exam. (Conditionnel Passé)"
  ],
  [
    "il/elle/on aurait lu",
    "he/she would have read",
    "Elle aurait lu ce roman si elle avait su à quel point il était captivant.",
    "She would have read this novel if she had known how captivating it was. (Conditionnel Passé)"
  ],
  [
    "nous aurions lu",
    "we would have read",
    "Nous aurions lu ce livre ensemble si nos emplois du temps avaient coïncidé.",
    "We would have read this book together if our schedules had matched. (Conditionnel Passé)"
  ],
  [
    "vous auriez lu",
    "you would have read (formal)",
    "Vous auriez lu tous ces documents si vous aviez su qu'ils étaient essentiels pour cette décision.",
    "You would have read all these documents if you had known they were essential for this decision. (Conditionnel Passé)"
  ],
  [
    "ils/elles auraient lu",
    "they would have read",
    "Ils auraient lu tous ces livres si leur professeur les avait recommandés plus tôt.",
    "They would have read all these books if their teacher had recommended them earlier. (Conditionnel Passé)"
  ],
  [
    "lisant",
    "reading",
    "En lisant ce livre fascinant, j'ai découvert un nouveau monde et j'ai appris énormément sur moi-même.",
    "While reading this fascinating book, I discovered a new world and learned a lot about myself. (Le participe présent)"
  ],
  [
    "j'agis",
    "I act",
    "J'agis toujours selon mes valeurs, même quand c'est difficile ou impopulaire.",
    "I always act according to my values, even when it's difficult or unpopular. (Présent)"
  ],
  [
    "tu agis",
    "you act (informal)",
    "Tu agis avec beaucoup de générosité envers les autres, c'est vraiment admirable!",
    "You act with great generosity towards others, that's really admirable! (Présent)"
  ],
  [
    "il/elle/on agit",
    "he/she acts",
    "Elle agit avec compassion et empathie dans toutes les situations difficiles.",
    "She acts with compassion and empathy in all difficult situations. (Présent)"
  ],
  [
    "nous agissons",
    "we act",
    "Nous agissons ensemble pour protéger l'environnement et créer un avenir meilleur.",
    "We act together to protect the environment and create a better future. (Présent)"
  ],
  [
    "vous agissez",
    "you act (formal)",
    "Vous agissez avec une grande sagesse et expérience dans votre domaine professionnel.",
    "You act with great wisdom and experience in your professional field. (Présent)"
  ],
  [
    "ils/elles agissent",
    "they act",
    "Ils agissent avec courage et détermination pour défendre leurs convictions.",
    "They act with courage and determination to defend their convictions. (Présent)"
  ],
  [
    "j'agissais",
    "I was acting",
    "J'agissais selon mes convictions profondes quand j'étais plus jeune, et je le fais toujours aujourd'hui.",
    "I was acting according to my deep convictions when I was younger, and I still do it today. (Imparfait)"
  ],
  [
    "tu agissais",
    "you were acting (informal)",
    "Tu agissais toujours avec bienveillance et gentillesse envers tout le monde, même les personnes difficiles.",
    "You always used to act with kindness and gentleness towards everyone, even difficult people. (Imparfait)"
  ],
  [
    "il/elle/on agissait",
    "he/she was acting",
    "Il agissait avec beaucoup de prudence et de réflexion avant chaque décision importante.",
    "He was acting with much caution and reflection before each important decision. (Imparfait)"
  ],
  [
    "nous agissions",
    "we were acting",
    "Nous agissions en équipe soudée pour surmonter tous les obstacles qui se présentaient.",
    "We were acting as a united team to overcome all the obstacles that presented themselves. (Imparfait)"
  ],
  [
    "vous agissiez",
    "you were acting (formal)",
    "Vous agissiez avec un professionnalisme remarquable dans toutes les situations complexes.",
    "You were acting with remarkable professionalism in all complex situations. (Imparfait)"
  ],
  [
    "ils/elles agissaient",
    "they were acting",
    "Ils agissaient avec un courage exemplaire face à l'adversité et aux défis de la vie.",
    "They were acting with exemplary courage in the face of adversity and life's challenges. (Imparfait)"
  ],
  [
    "j'ai agi",
    "I have acted",
    "J'ai agi rapidement et efficacement pour résoudre ce problème avant qu'il ne s'aggrave.",
    "I have acted quickly and efficiently to solve this problem before it got worse. (Passé Composé)"
  ],
  [
    "tu as agi",
    "you have acted (informal)",
    "Tu as agi avec une sagesse remarquable dans cette décision qui allait changer ta vie.",
    "You have acted with remarkable wisdom in this decision that was going to change your life. (Passé Composé)"
  ],
  [
    "il/elle/on a agi",
    "he/she has acted",
    "Elle a agi avec détermination et persévérance pour réaliser son rêve de devenir médecin.",
    "She has acted with determination and perseverance to achieve her dream of becoming a doctor. (Passé Composé)"
  ],
  [
    "nous avons agi",
    "we have acted",
    "Nous avons agi ensemble avec solidarité pour aider les personnes dans le besoin.",
    "We have acted together with solidarity to help people in need. (Passé Composé)"
  ],
  [
    "vous avez agi",
    "you have acted (formal)",
    "Vous avez agi avec une intégrité exemplaire dans cette affaire délicate et complexe.",
    "You have acted with exemplary integrity in this delicate and complex matter. (Passé Composé)"
  ],
  [
    "ils/elles ont agi",
    "they have acted",
    "Ils ont agi avec courage et détermination pour défendre leurs droits et leurs convictions.",
    "They have acted with courage and determination to defend their rights and convictions. (Passé Composé)"
  ],
  [
    "j'agirai",
    "I will act",
    "J'agirai selon mes principes et mes valeurs, peu importe les conséquences.",
    "I will act according to my principles and values, regardless of the consequences. (Futur Simple)"
  ],
  [
    "tu agiras",
    "you will act (informal)",
    "Tu agiras avec prudence et réflexion avant de prendre cette décision importante pour ton avenir.",
    "You will act with caution and reflection before making this important decision for your future. (Futur Simple)"
  ],
  [
    "il/elle/on agira",
    "he/she will act",
    "Elle agira rapidement et efficacement pour résoudre ce problème urgent.",
    "She will act quickly and efficiently to solve this urgent problem. (Futur Simple)"
  ],
  [
    "nous agirons",
    "we will act",
    "Nous agirons ensemble avec détermination pour créer un changement positif dans notre communauté.",
    "We will act together with determination to create positive change in our community. (Futur Simple)"
  ],
  [
    "vous agirez",
    "you will act (formal)",
    "Vous agirez avec responsabilité et professionnalisme dans toutes vos décisions importantes.",
    "You will act with responsibility and professionalism in all your important decisions. (Futur Simple)"
  ],
  [
    "ils/elles agiront",
    "they will act",
    "Ils agiront avec courage et détermination pour défendre leurs droits et leurs valeurs.",
    "They will act with courage and determination to defend their rights and values. (Futur Simple)"
  ],
  [
    "j'agirais",
    "I would act",
    "J'agirais différemment si j'avais toutes les informations nécessaires pour prendre une décision éclairée.",
    "I would act differently if I had all the necessary information to make an informed decision. (Conditionnel Présent)"
  ],
  [
    "tu agirais",
    "you would act (informal)",
    "Tu agirais avec plus de prudence et de réflexion si tu connaissais tous les enjeux de cette situation.",
    "You would act with more caution and reflection if you knew all the stakes of this situation. (Conditionnel Présent)"
  ],
  [
    "il/elle/on agirait",
    "he/she would act",
    "Elle agirait avec sagesse et expérience si elle avait accès à tous les détails de cette affaire complexe.",
    "She would act with wisdom and experience if she had access to all the details of this complex matter. (Conditionnel Présent)"
  ],
  [
    "nous agirions",
    "we would act",
    "Nous agirions ensemble avec plus d'efficacité si nous avions plus de temps et de ressources.",
    "We would act together with more efficiency if we had more time and resources. (Conditionnel Présent)"
  ],
  [
    "vous agiriez",
    "you would act (formal)",
    "Vous agiriez avec un professionnalisme remarquable si les circonstances étaient différentes.",
    "You would act with remarkable professionalism if the circumstances were different. (Conditionnel Présent)"
  ],
  [
    "ils/elles agiraient",
    "they would act",
    "Ils agiraient avec courage et détermination s'ils étaient confrontés à ce défi important.",
    "They would act with courage and determination if they were faced with this important challenge. (Conditionnel Présent)"
  ],
  [
    "agissant",
    "acting",
    "En agissant rapidement et avec détermination, nous avons réussi à éviter une catastrophe et à sauver de nombreuses vies.",
    "By acting quickly and with determination, we succeeded in avoiding a catastrophe and saving many lives. (Le participe présent)"
  ]
]