[
  ["Allez, viens avec nous ! Ce sera super fun !", "Come on, come with us! It'll be super fun!"],
  ["Tu vas vraiment rater quelque chose d'incroyable si tu n'y vas pas.", "You're really going to miss something incredible if you don't go."],
  ["Je te promets que tu ne vas pas le regretter !", "I promise you won't regret it!"],
  ["C'est vraiment pas cher pour ce que tu vas avoir.", "It's really not expensive for what you're going to get."],
  ["Tous nos amis y vont, tu vas être tout seul si tu restes ici.", "All our friends are going, you'll be all alone if you stay here."],
  ["Écoute, essaie juste une fois, et si tu n'aimes pas, on ne te force plus jamais.", "Listen, just try it once, and if you don't like it, we'll never force you again."],
  ["C'est une occasion unique, tu ne pourras plus faire ça après.", "It's a unique opportunity, you won't be able to do this later."],
  ["Je vais te payer ton billet si tu veux, juste pour que tu viennes.", "I'll pay for your ticket if you want, just so you come."],
  ["Tu me fais confiance, non ? Je ne te proposerais jamais quelque chose de nul.", "You trust me, right? I would never suggest something lame to you."],
  ["Bon, d'accord, on peut y aller ensemble si ça te rassure.", "Okay, fine, we can go together if that makes you feel better."],
  ["Franchement, tu es en train de passer à côté de quelque chose de génial.", "Honestly, you're missing out on something great."],
  ["Moi aussi j'avais peur au début, mais maintenant je suis accro !", "I was scared at first too, but now I'm hooked!"],
  ["C'est exactement ton style, je le sens !", "It's exactly your style, I can feel it!"],
  ["On va s'amuser comme des fous, tu vas voir !", "We're going to have a blast, you'll see!"],
  ["Si tu n'aimes vraiment pas, on peut partir après 30 minutes.", "If you really don't like it, we can leave after 30 minutes."],
  ["C'est le dernier jour pour s'inscrire, tu ne peux pas laisser passer ça !", "It's the last day to register, you can't let this pass!"],
  ["Tout le monde va te poser des questions si tu n'y vas pas.", "Everyone's going to ask you questions if you don't go."],
  ["Je vais te tenir la main tout le long si tu veux !", "I'll hold your hand the whole time if you want!"],
  ["Tu vas me faire de la peine si tu ne viens pas avec moi.", "You're going to make me sad if you don't come with me."],
  ["C'est vraiment pas compliqué, je vais t'expliquer tout !", "It's really not complicated, I'll explain everything to you!"],
  ["Tu vas voir, c'est beaucoup mieux que ce que tu penses.", "You'll see, it's much better than you think."],
  ["On a besoin de toi là-bas, tu es indispensable !", "We need you there, you're indispensable!"],
  ["C'est gratuit pour toi, tu n'as rien à perdre !", "It's free for you, you have nothing to lose!"],
  ["Je vais te montrer des photos, tu vas changer d'avis !", "I'll show you photos, you'll change your mind!"],
  ["C'est exactement ce dont tu as besoin en ce moment.", "It's exactly what you need right now."],
  ["Tu vas rencontrer des gens super intéressants !", "You're going to meet super interesting people!"],
  ["Moi je vais y aller de toute façon, autant qu'on y aille ensemble !", "I'm going anyway, might as well go together!"],
  ["C'est une expérience qui va te marquer pour la vie.", "It's an experience that will mark you for life."],
  ["Tu ne peux pas rester dans ta zone de confort toute ta vie !", "You can't stay in your comfort zone your whole life!"],
  ["C'est le moment parfait pour essayer quelque chose de nouveau.", "It's the perfect time to try something new."],
  ["Je vais te donner tous les détails, tu vas être convaincu !", "I'll give you all the details, you'll be convinced!"],
  ["C'est vraiment pas dangereux, je te jure !", "It's really not dangerous, I swear!"],
  ["Tu vas me manquer si tu n'y vas pas avec moi.", "I'll miss you if you don't go with me."],
  ["C'est une chance en or, tu ne peux pas la rater !", "It's a golden opportunity, you can't miss it!"],
  ["On va créer des souvenirs inoubliables ensemble !", "We're going to create unforgettable memories together!"],
  ["Tu vas me faire confiance cette fois-ci, s'il te plaît ?", "You're going to trust me this time, please?"],
  ["C'est exactement le genre de truc que tu adores !", "It's exactly the kind of thing you love!"],
  ["Je vais te tenir au courant de tout ce qui se passe.", "I'll keep you informed of everything that happens."],
  ["C'est exactement le type d'aventure que tu cherches !", "It's exactly the type of adventure you're looking for!"],
  ["Tu vas être la star de la soirée, je te le garantis !", "You're going to be the star of the evening, I guarantee it!"],
  ["On va se faire des amis pour la vie là-bas !", "We're going to make friends for life there!"],
  ["C'est une tradition dans notre groupe, tu ne peux pas manquer ça !", "It's a tradition in our group, you can't miss this!"],
  ["Tu vas découvrir un nouveau côté de toi-même !", "You're going to discover a new side of yourself!"],
  ["C'est vraiment pas loin, on peut y aller à pied !", "It's really not far, we can walk there!"],
  ["Je vais te présenter à tout le monde, tu vas te sentir à l'aise !", "I'll introduce you to everyone, you'll feel comfortable!"],
  ["C'est le genre d'expérience qui change une personne !", "It's the kind of experience that changes a person!"],
  ["Tu vas me faire plaisir si tu viens avec moi !", "You'll make me happy if you come with me!"],
  ["C'est vraiment pas cher, tu peux te le permettre !", "It's really not expensive, you can afford it!"],
  ["On va rigoler toute la soirée, tu vas voir !", "We're going to laugh all evening, you'll see!"],
  ["C'est exactement ce que tu m'as dit vouloir faire !", "It's exactly what you told me you wanted to do!"],
  ["Tu vas me faire confiance, je connais tes goûts !", "You're going to trust me, I know your tastes!"],
  ["C'est une occasion en or, tu ne la retrouveras jamais !", "It's a golden opportunity, you'll never find it again!"],
  ["On va créer des souvenirs dont on parlera pendant des années !", "We're going to create memories we'll talk about for years!"],
  ["Tu vas être surpris de voir à quel point c'est génial !", "You're going to be surprised at how great it is!"],
  ["C'est vraiment pas difficile, même un enfant peut le faire !", "It's really not difficult, even a child can do it!"],
  ["Tu vas me faire honte si tu n'y vas pas !", "You're going to embarrass me if you don't go!"],
  ["C'est exactement le moment parfait pour toi !", "It's exactly the perfect moment for you!"],
  ["On va passer un moment inoubliable ensemble !", "We're going to have an unforgettable time together!"],
  ["Tu vas me faire confiance cette fois, s'il te plaît ?", "You're going to trust me this time, please?"],
  ["C'est vraiment pas dangereux, je l'ai fait plein de fois !", "It's really not dangerous, I've done it many times!"],
  ["Tu vas être la première à essayer, c'est un privilège !", "You're going to be the first to try, it's a privilege!"],
  ["C'est exactement ce dont tu as besoin pour te détendre !", "It's exactly what you need to relax!"],
  ["On va se faire des photos de folie !", "We're going to take crazy photos!"],
  ["Tu vas me faire confiance, je ne te mentirais jamais !", "You're going to trust me, I would never lie to you!"],
  ["C'est une expérience unique, tu ne peux pas la rater !", "It's a unique experience, you can't miss it!"],
  ["Tu vas être fier de toi après avoir fait ça !", "You're going to be proud of yourself after doing this!"],
  ["C'est exactement le genre de défi que tu aimes !", "It's exactly the kind of challenge you like!"],
  ["On va se faire des souvenirs à raconter à nos enfants !", "We're going to make memories to tell our children!"],
  ["Tu vas me faire plaisir si tu acceptes !", "You'll make me happy if you accept!"],
  ["C'est vraiment pas compliqué, je vais te guider !", "It's really not complicated, I'll guide you!"],
  ["Tu vas découvrir quelque chose d'incroyable !", "You're going to discover something incredible!"],
  ["C'est exactement ce que tu cherches depuis longtemps !", "It's exactly what you've been looking for for a long time!"],
  ["On va se faire des amis du monde entier !", "We're going to make friends from all over the world!"],
  ["Tu vas me faire confiance, je connais tes limites !", "You're going to trust me, I know your limits!"],
  ["C'est une chance unique, tu ne peux pas la laisser passer !", "It's a unique chance, you can't let it pass!"],
  ["Tu vas être surpris de voir à quel point c'est amusant !", "You're going to be surprised at how fun it is!"],
  ["C'est exactement le type d'expérience que tu adores !", "It's exactly the type of experience you love!"],
  ["On va se faire des souvenirs pour la vie !", "We're going to make memories for life!"],
  ["Tu devrais venir, c’est une super expérience.", "You should come, it's a great experience.", "Tu devrais venir, c’est une super expérience, on va bien s’amuser.", "You should come, it's a great experience — we’ll have fun."],
  ["Franchement, tu ne le regretteras pas.", "Honestly, you won’t regret it.", "Franchement, tu ne le regretteras pas, c’est toujours un bon moment.", "Honestly, you won’t regret it — it’s always a good time."],
  ["Allez, fais un effort, viens avec moi !", "Come on, make an effort, come with me!", "Allez, fais un effort, viens avec moi, ça te changera les idées.", "Come on, make an effort, come with me, it’ll do you good."],
  ["Ça vaut vraiment la peine.", "It’s really worth it.", "Je te promets, ça vaut vraiment la peine d’essayer.", "I promise, it’s really worth trying."],
  ["Même si tu es débutant, c’est fait pour tout le monde.", "Even if you’re a beginner, it’s for everyone.", "Même si tu es débutant, c’est fait pour tout le monde, le prof est très patient.", "Even if you’re a beginner, it’s for everyone, the teacher is very patient."],
  ["Ce sera une belle occasion de se détendre.", "It’ll be a nice opportunity to relax.", "Ce sera une belle occasion de se détendre et de profiter du week-end.", "It’ll be a nice opportunity to relax and enjoy the weekend."],
  ["On ne fait pas ça tous les jours !", "We don’t do that every day!", "On ne fait pas ça tous les jours, alors autant en profiter !", "We don’t do that every day, so we might as well enjoy it!"],
  ["Ça te fera du bien.", "It’ll do you good.", "Viens, ça te fera du bien de sortir un peu.", "Come, it’ll do you good to get out a bit."],
  ["Ce n’est pas si cher pour tout ce qu’on fait.", "It’s not that expensive for everything included.", "Honnêtement, ce n’est pas si cher pour tout ce qu’on fait.", "Honestly, it’s not that expensive for everything we get."],
  ["Et puis, on pourra y aller ensemble.", "And besides, we can go together.", "Et puis, on pourra y aller ensemble, ce sera plus sympa.", "And besides, we can go together — it’ll be more fun."],
  ["Tu aimes essayer de nouvelles choses, non ?", "You like trying new things, right?", "Tu aimes essayer de nouvelles choses, non ? Ce serait parfait pour toi.", "You like trying new things, right? This would be perfect for you."],
  ["C’est une bonne occasion de rencontrer du monde.", "It’s a good chance to meet people.", "C’est une bonne occasion de rencontrer du monde et de passer un bon moment.", "It’s a good chance to meet people and have a good time."],
  ["Honnêtement, ça a l’air génial.", "Honestly, it looks amazing.", "Honnêtement, ça a l’air génial, j’ai vraiment envie d’y aller.", "Honestly, it looks amazing — I really want to go."],
  ["Ce n’est pas grave si tu ne sais pas tout faire.", "It doesn’t matter if you don’t know how to do everything.", "Ce n’est pas grave si tu ne sais pas tout faire, c’est justement pour apprendre.", "It doesn’t matter if you can’t do everything — it’s to learn!"],
  ["C’est une activité différente, un peu originale.", "It’s a different, unique kind of activity.", "C’est une activité différente, un peu originale, ça change du quotidien.", "It’s a different, unique kind of activity — a nice change of pace."],
  ["Tu verras, c’est super amusant.", "You’ll see, it’s really fun.", "Tu verras, c’est super amusant, tout le monde rit et participe.", "You’ll see, it’s really fun — everyone laughs and joins in."],
  ["Il n’y a rien à perdre, seulement à gagner.", "There’s nothing to lose, only to gain.", "Franchement, il n’y a rien à perdre, seulement à gagner.", "Honestly, there’s nothing to lose, only to gain."],
  ["On pourra en parler après autour d’un café.", "We can talk about it afterwards over coffee.", "On pourra en parler après autour d’un café, ce sera sympa.", "We can talk about it afterwards over coffee — it’ll be nice."],
  ["Je t’assure que tu vas aimer.", "I promise you’ll like it.", "Je t’assure que tu vas aimer, c’est exactement ton style.", "I promise you’ll like it — it’s exactly your style."],
  ["Allez, lance-toi, on y va !", "Come on, go for it, let’s go!", "Allez, lance-toi, on y va ! Ce sera une belle expérience.", "Come on, go for it, let’s go! It’ll be a great experience."]

  
]
