[
  [
    "recevoir",
    "to receive",
    "J'ai reçu une invitation formelle pour le gala de bienfaisance.",
    "I received a formal invitation to the charity gala. (Passé composé)"
  ],
  [
    "recevoir",
    "to receive",
    "Nous recevrons les résultats de l'examen la semaine prochaine.",
    "We will receive the exam results next week. (Futur)"
  ],
  [
    "recevoir",
    "to receive",
    "Elle recevait régulièrement des lettres de ses correspondants internationaux.",
    "She used to receive letters regularly from her international pen pals. (Imparfait)"
  ],
  [
    "reconnaître",
    "to recognize",
    "Je reconnais immédiatement cette mélodie classique.",
    "I recognize this classical melody immediately. (Présent)"
  ],
  [
    "reconnaître",
    "to recognize",
    "Il a reconnu son erreur et s'est excusé publiquement.",
    "He recognized his mistake and apologized publicly. (Passé composé)"
  ],
  [
    "reconnaître",
    "to recognize",
    "Nous reconnaîtrions cette architecture n'importe où dans le monde.",
    "We would recognize this architecture anywhere in the world. (Conditionnel)"
  ],
  [
    "se reconnaître",
    "to recognize oneself",
    "Il ne se reconnaît plus dans le miroir après toutes ces années.",
    "He no longer recognizes himself in the mirror after all these years. (Présent)"
  ],
  [
    "recommander",
    "to recommend",
    "Je recommande vivement ce restaurant pour son ambiance raffinée.",
    "I highly recommend this restaurant for its refined atmosphere. (Présent)"
  ],
  [
    "recommander",
    "to recommend",
    "Le médecin lui avait recommandé de faire plus d'exercice.",
    "The doctor had recommended that he exercise more. (Plus-que-parfait)"
  ],
  [
    "recommander",
    "to recommend",
    "Nous recommanderons cette stratégie lors de la prochaine réunion.",
    "We will recommend this strategy at the next meeting. (Futur)"
  ],
  [
    "réfléchir",
    "to think / to reflect",
    "Il faut réfléchir attentivement avant de prendre une décision importante.",
    "One must think carefully before making an important decision. (Présent)"
  ],
  [
    "réfléchir",
    "to think / to reflect",
    "J'ai longuement réfléchi à cette proposition avant d'accepter.",
    "I thought long and hard about this proposal before accepting. (Passé composé)"
  ],
  [
    "réfléchir",
    "to think / to reflect",
    "Elle réfléchissait à son avenir professionnel pendant ses études.",
    "She was thinking about her professional future during her studies. (Imparfait)"
  ],
  [
    "refuser",
    "to refuse",
    "Il refuse catégoriquement de participer à cette discussion.",
    "He categorically refuses to participate in this discussion. (Présent)"
  ],
  [
    "refuser",
    "to refuse",
    "Nous avons refusé l'offre car elle ne correspondait pas à nos attentes.",
    "We refused the offer because it didn't meet our expectations. (Passé composé)"
  ],
  [
    "refuser",
    "to refuse",
    "Elle refuserait probablement si on lui proposait ce poste.",
    "She would probably refuse if we offered her this position. (Conditionnel)"
  ],
  [
    "regarder",
    "to look / to watch",
    "Regardez attentivement cette œuvre d'art contemporaine.",
    "Look carefully at this contemporary artwork. (Présent - impératif)"
  ],
  [
    "regarder",
    "to look / to watch",
    "Nous regardions un documentaire fascinant sur l'histoire de l'art.",
    "We were watching a fascinating documentary on art history. (Imparfait)"
  ],
  [
    "regarder",
    "to look / to watch",
    "Ils regarderont le match de football ce soir à la télévision.",
    "They will watch the football match tonight on television. (Futur)"
  ],
  [
    "se regarder",
    "to look at oneself",
    "Elle se regardait dans le miroir en essayant sa nouvelle robe.",
    "She was looking at herself in the mirror while trying on her new dress. (Imparfait)"
  ],
  [
    "regretter",
    "to regret",
    "Je regrette profondément de ne pas avoir voyagé davantage dans ma jeunesse.",
    "I deeply regret not having traveled more in my youth. (Présent)"
  ],
  [
    "regretter",
    "to regret",
    "Elle a regretté sa décision impulsive après avoir réfléchi.",
    "She regretted her impulsive decision after thinking about it. (Passé composé)"
  ],
  [
    "regretter",
    "to regret",
    "Nous regretterions de ne pas saisir cette opportunité unique.",
    "We would regret not seizing this unique opportunity. (Conditionnel)"
  ],
  [
    "remettre",
    "to put back / to give back / to postpone",
    "Pouvez-vous remettre ce livre à sa place dans la bibliothèque ?",
    "Can you put this book back in its place in the library? (Présent)"
  ],
  [
    "remettre",
    "to put back / to give back / to postpone",
    "J'ai remis les clés à mon voisin avant de partir en vacances.",
    "I gave the keys back to my neighbor before leaving on vacation. (Passé composé)"
  ],
  [
    "remettre",
    "to put back / to give back / to postpone",
    "La réunion a été remise à la semaine prochaine pour des raisons logistiques.",
    "The meeting was postponed to next week for logistical reasons. (Passé composé - voix passive)"
  ],
  [
    "se remettre",
    "to recover / to get back to",
    "Il s'est remis rapidement de sa maladie grâce aux soins médicaux appropriés.",
    "He recovered quickly from his illness thanks to appropriate medical care. (Passé composé)"
  ],
  [
    "se remettre",
    "to recover / to get back to",
    "Nous nous remettons au travail après cette pause bien méritée.",
    "We're getting back to work after this well-deserved break. (Présent)"
  ],
  [
    "répondre",
    "to answer / to reply",
    "Il faut répondre à cette question avec précision et clarté.",
    "One must answer this question with precision and clarity. (Présent)"
  ],
  [
    "répondre",
    "to answer / to reply",
    "Elle a répondu immédiatement à mon courriel professionnel.",
    "She replied immediately to my professional email. (Passé composé)"
  ],
  [
    "répondre",
    "to answer / to reply",
    "Nous répondrions volontiers à vos questions si nous avions plus de temps.",
    "We would gladly answer your questions if we had more time. (Conditionnel)"
  ],
  [
    "résoudre",
    "to solve / to resolve",
    "Les scientifiques tentent de résoudre ce problème complexe depuis des années.",
    "Scientists have been trying to solve this complex problem for years. (Présent)"
  ],
  [
    "résoudre",
    "to solve / to resolve",
    "Ils ont résolu le conflit diplomatique grâce à des négociations intensives.",
    "They resolved the diplomatic conflict through intensive negotiations. (Passé composé)"
  ],
  [
    "résoudre",
    "to solve / to resolve",
    "Nous résoudrions cette équation mathématique si nous avions les bonnes formules.",
    "We would solve this mathematical equation if we had the right formulas. (Conditionnel)"
  ],
  [
    "se résoudre",
    "to resolve oneself / to make up one's mind",
    "Elle s'est résolue à quitter son emploi pour poursuivre ses rêves.",
    "She resolved to leave her job to pursue her dreams. (Passé composé)"
  ],
  [
    "retourner",
    "to return / to go back",
    "Je dois retourner à la bibliothèque pour rendre ce livre emprunté.",
    "I must return to the library to return this borrowed book. (Présent)"
  ],
  [
    "retourner",
    "to return / to go back",
    "Elle est retournée dans son pays natal après avoir terminé ses études.",
    "She returned to her home country after finishing her studies. (Passé composé)"
  ],
  [
    "retourner",
    "to return / to go back",
    "Nous retournerions volontiers dans cette région si nous avions l'occasion.",
    "We would gladly return to this region if we had the opportunity. (Conditionnel)"
  ],
  [
    "se retourner",
    "to turn around / to turn over",
    "Il s'est retourné brusquement en entendant son nom appelé.",
    "He turned around suddenly upon hearing his name called. (Passé composé)"
  ],
  [
    "se retourner",
    "to turn around / to turn over",
    "La situation s'est retournée complètement en notre faveur.",
    "The situation turned completely in our favor. (Passé composé)"
  ],
  [
    "retrouver",
    "to find again / to meet again / to recover",
    "J'espère retrouver mon ancien professeur lors de la cérémonie de remise des diplômes.",
    "I hope to meet my former teacher again at the graduation ceremony. (Présent)"
  ],
  [
    "retrouver",
    "to find again / to meet again / to recover",
    "Il a retrouvé sa confiance en soi après cette période difficile.",
    "He recovered his self-confidence after this difficult period. (Passé composé)"
  ],
  [
    "retrouver",
    "to find again / to meet again / to recover",
    "Nous retrouvions nos amis d'enfance chaque été dans ce petit village.",
    "We used to meet our childhood friends every summer in this small village. (Imparfait)"
  ],
  [
    "se retrouver",
    "to find oneself / to end up",
    "Nous nous sommes retrouvés dans un restaurant élégant sans l'avoir prévu.",
    "We ended up in an elegant restaurant without having planned it. (Passé composé)"
  ],
  [
    "se retrouver",
    "to find oneself / to end up",
    "Elle se retrouve souvent seule le week-end depuis son déménagement.",
    "She often finds herself alone on weekends since her move. (Présent)"
  ],
  [
    "rencontrer",
    "to meet / to encounter",
    "Je vais rencontrer mon nouveau collègue demain matin au bureau.",
    "I'm going to meet my new colleague tomorrow morning at the office. (Futur proche)"
  ],
  [
    "rencontrer",
    "to meet / to encounter",
    "Elle a rencontré des difficultés inattendues lors de son projet de recherche.",
    "She encountered unexpected difficulties during her research project. (Passé composé)"
  ],
  [
    "rencontrer",
    "to meet / to encounter",
    "Nous rencontrions souvent des artistes locaux dans ce café branché.",
    "We used to meet local artists often in this trendy café. (Imparfait)"
  ],
  [
    "se rencontrer",
    "to meet each other",
    "Ils se sont rencontrés pour la première fois lors d'une conférence internationale.",
    "They met each other for the first time at an international conference. (Passé composé)"
  ],
  [
    "se rencontrer",
    "to meet each other",
    "Nous nous rencontrerons demain matin pour discuter de ce projet important.",
    "We will meet each other tomorrow morning to discuss this important project. (Futur)"
  ],
  [
    "reporter",
    "to postpone / to report / to carry over",
    "Nous devons reporter la réunion à cause des conditions météorologiques défavorables.",
    "We must postpone the meeting due to unfavorable weather conditions. (Présent)"
  ],
  [
    "reporter",
    "to postpone / to report / to carry over",
    "Le journaliste a reporté les événements avec une précision remarquable.",
    "The journalist reported the events with remarkable accuracy. (Passé composé)"
  ],
  [
    "reporter",
    "to postpone / to report / to carry over",
    "Ils reporteraient cette décision importante s'ils avaient plus d'informations.",
    "They would postpone this important decision if they had more information. (Conditionnel)"
  ],
  [
    "se reporter",
    "to refer to",
    "Pour plus de détails, veuillez vous reporter au document officiel.",
    "For more details, please refer to the official document. (Présent - impératif)"
  ],
  [
    "se reporter",
    "to refer to",
    "Elle s'est reportée aux notes précédentes pour comprendre le contexte.",
    "She referred to the previous notes to understand the context. (Passé composé)"
  ]
]

