[
  ["se reposer", "to rest", "Le dimanche, j'aime bien me reposer après une longue semaine.", "On Sunday, I like to rest after a long week."],
  ["se lever tôt", "to get up early", "Je dois me lever tôt pour participer à la randonnée.", "I have to get up early to participate in the hike."],
  ["faire une randonnée", "to go hiking", "On va faire une randonnée au Mont-Royal dimanche.", "We're going hiking on Mount Royal on Sunday."],
  ["avoir envie de", "to feel like / want to", "Je n'ai pas envie de sortir quand il fait froid.", "I don't feel like going out when it's cold."],
  ["il va faire froid", "it's going to be cold", "Il va faire froid à la fin du mois d'octobre.", "It's going to be cold at the end of October."],
  ["ça vaut la peine", "it's worth it", "Ça vaut la peine d'y aller, c'est pour une bonne cause.", "It's worth going, it's for a good cause."],
  ["planter un arbre", "to plant a tree", "Chaque kilomètre parcouru permet de planter un arbre.", "Every kilometer walked allows us to plant a tree."],
  ["une bonne cause", "a good cause", "Je participe pour soutenir une bonne cause.", "I'm participating to support a good cause."],
  ["convaincre quelqu'un de", "to convince someone to", "J'essaie de convaincre Sophie de venir avec moi.", "I'm trying to convince Sophie to come with me."],
  ["en plein air", "outdoors", "C'est une activité de plein air très agréable.", "It's a very pleasant outdoor activity."],
  ["il faut que + subjonctif", "it's necessary that + subjunctive", "Il faut que tu viennes, ce sera amusant.", "You need to come, it will be fun."],
  ["ça te ferait du bien", "it would do you good", "Ça te ferait du bien de marcher un peu en nature.", "It would do you good to walk a bit in nature."],
  ["ça ne prend pas beaucoup de temps", "it doesn't take much time", "Ne t'inquiète pas, ça ne prend pas beaucoup de temps.", "Don't worry, it doesn't take much time."],
  ["même si", "even if", "Même s'il fait froid, on peut bien s'habiller.", "Even if it's cold, we can dress warmly."],
  ["en plus", "in addition / plus", "En plus, il y aura un concert à la fin de la marche.", "Plus, there will be a concert at the end of the walk."],
  ["ça dépend de", "it depends on", "Ça dépend du temps, mais je pense qu'il fera beau.", "It depends on the weather, but I think it will be nice."],
  ["je te promets que", "I promise you that", "Je te promets que tu ne vas pas le regretter.", "I promise you won't regret it."],
  ["être motivé(e)", "to be motivated", "Je suis motivé pour faire quelque chose de bien ce week-end.", "I'm motivated to do something good this weekend."],
  ["ça te dit de", "do you feel like / want to", "Ça te dit de venir avec moi dimanche ?", "Do you feel like coming with me on Sunday?"],
  ["je n'ai pas trop envie", "I don't really feel like", "Je n'ai pas trop envie de marcher aujourd'hui.", "I don't really feel like walking today."],
  ["au lieu de", "instead of", "Au lieu de rester à la maison, viens marcher avec moi !", "Instead of staying home, come walk with me!"],
  ["c'est gratuit pour", "it's free for", "C'est gratuit pour les enfants et pas cher pour les adultes.", "It's free for children and not expensive for adults."],
  ["dans la nature", "in nature", "C'est agréable de passer du temps dans la nature.", "It's pleasant to spend time in nature."],
  ["profiter de", "to take advantage of / enjoy", "On peut profiter du beau temps ensemble.", "We can enjoy the nice weather together."],
  ["faire du bien", "to do good / be good for", "Marcher un peu te fera du bien.", "Walking a bit will do you good."],
  ["être fatigué(e)", "to be tired", "Je serai peut-être fatigué après, mais content d'y aller.", "I might be tired after, but happy to go."],
  ["soutenir", "to support", "C'est important de soutenir des initiatives écologiques.", "It's important to support ecological initiatives."],
  ["faire un effort", "to make an effort", "Fais un petit effort, tu verras, ce sera sympa.", "Make a little effort, you'll see, it will be nice."],
  ["en fait", "actually / in fact", "En fait, la marche est très facile, accessible à tous.", "Actually, the walk is very easy, accessible to everyone."],
  ["à la fin", "at the end", "À la fin, il y aura un pique-nique et de la musique.", "At the end, there will be a picnic and music."],
  ["au début", "at the beginning", "Au début, on se retrouve à l'entrée du parc.", "At the beginning, we meet at the park entrance."],
  ["je trouve que", "I think that", "Je trouve que c'est une super idée pour le dimanche.", "I think it's a great idea for Sunday."],
  ["c'est dommage que", "it's a shame that", "C'est dommage que tu ne veuilles pas venir.", "It's a shame you don't want to come."],
  ["grâce à", "thanks to", "Grâce à cette marche, on va financer la reforestation.", "Thanks to this walk, we're going to finance reforestation."],
  ["parce que", "because", "Je veux y aller parce que j'aime la nature.", "I want to go because I love nature."],
  ["bien s'habiller", "to dress warmly", "Si tu te couvres bien, tu n'auras pas froid.", "If you dress warmly, you won't be cold."],
  ["ça ne coûte presque rien", "it costs almost nothing", "La participation ne coûte presque rien.", "Participation costs almost nothing."],
  ["une occasion de", "an opportunity to", "C'est une belle occasion de se retrouver entre amis.", "It's a great opportunity to get together with friends."],
  ["avoir raison", "to be right", "Tu as raison, il faut se reposer parfois.", "You're right, we need to rest sometimes."],
  ["tu n'as qu'à", "you just have to", "Tu n'as qu'à venir et tu décideras sur place.", "You just have to come and you'll decide on the spot."],
  ["je suis sûr(e) que", "I'm sure that", "Je suis sûr que tu vas adorer l'ambiance.", "I'm sure you're going to love the atmosphere."],
  ["si jamais", "if ever", "Si jamais tu changes d'avis, dis-le-moi vite.", "If you ever change your mind, tell me quickly."],
  ["ce serait bien que", "it would be good if", "Ce serait bien que tu viennes avec moi dimanche.", "It would be good if you came with me on Sunday."],
  ["ça me ferait plaisir", "it would please me", "Ça me ferait plaisir que tu viennes.", "It would please me if you came."],
  ["ne t'inquiète pas", "don't worry", "Ne t'inquiète pas, on ira doucement.", "Don't worry, we'll go slowly."],
  ["rater", "to miss", "Ce serait dommage de rater cet événement.", "It would be a shame to miss this event."],
  ["profiter de l'occasion", "to take advantage of the opportunity", "Profitons de l'occasion pour passer du temps ensemble.", "Let's take advantage of the opportunity to spend time together."],
  ["faire un don", "to make a donation", "Chaque participant peut faire un don pour les arbres.", "Each participant can make a donation for the trees."],
  ["être en forme", "to be in shape", "Je marche souvent pour rester en forme.", "I walk often to stay in shape."],
  ["s'inscrire", "to register", "On doit s'inscrire avant le 20 octobre sur le site.", "We have to register before October 20th on the website."]
]