[
  [
    "À mon avis",
    "In my opinion",
    "À mon avis, l'augmentation du coût de la vie représente un défi majeur pour les jeunes familles québécoises.",
    "In my opinion, the rising cost of living represents a major challenge for young Quebec families."
  ],
  [
    "Selon moi",
    "According to me / In my view",
    "Selon moi, les gouvernements devraient investir davantage dans les transports en commun pour réduire la pollution.",
    "According to me, governments should invest more in public transportation to reduce pollution."
  ],
  [
    "Personnellement",
    "Personally",
    "Personnellement, je crois que l'éducation gratuite est essentielle pour l'égalité des chances.",
    "Personally, I believe that free education is essential for equal opportunities."
  ],
  [
    "Je pense que",
    "I think that",
    "Je pense que la protection de l'environnement devrait être une priorité absolue pour notre société.",
    "I think that environmental protection should be an absolute priority for our society."
  ],
  [
    "Premièrement",
    "Firstly / First",
    "Premièrement, l'accès aux soins de santé doit être garanti à tous les citoyens sans exception.",
    "Firstly, access to healthcare must be guaranteed to all citizens without exception."
  ],
  [
    "Deuxièmement",
    "Secondly / Second",
    "Deuxièmement, il est nécessaire de moderniser les infrastructures pour répondre aux besoins croissants de la population.",
    "Secondly, it is necessary to modernize infrastructure to meet the growing needs of the population."
  ],
  [
    "Tout d'abord",
    "First of all",
    "Tout d'abord, il faut reconnaître que le changement climatique affecte déjà notre quotidien de manière significative.",
    "First of all, we must recognize that climate change is already significantly affecting our daily lives."
  ],
  [
    "Ensuite",
    "Then / Next",
    "Ensuite, nous devons considérer les solutions concrètes qui peuvent être mises en place immédiatement.",
    "Then, we must consider concrete solutions that can be implemented immediately."
  ],
  [
    "De plus",
    "Moreover / Furthermore",
    "Les nouvelles technologies créent de nombreux emplois. De plus, elles transforment complètement notre façon de travailler.",
    "New technologies create many jobs. Moreover, they completely transform our way of working."
  ],
  [
    "En outre",
    "Furthermore / In addition",
    "L'immigration enrichit notre culture. En outre, elle contribue de manière significative à notre économie.",
    "Immigration enriches our culture. Furthermore, it contributes significantly to our economy."
  ],
  [
    "Aussi",
    "Also / Too",
    "La qualité de l'éducation est importante. La formation continue des enseignants l'est aussi.",
    "The quality of education is important. Continuous teacher training is also important."
  ],
  [
    "Par ailleurs",
    "Furthermore / Moreover",
    "Le système de santé actuel fonctionne relativement bien. Par ailleurs, il nécessite des améliorations pour faire face aux défis futurs.",
    "The current healthcare system works relatively well. Furthermore, it requires improvements to face future challenges."
  ],
  [
    "En effet",
    "Indeed / In fact",
    "Cette mesure serait bénéfique pour tous. En effet, elle permettrait de réduire les inégalités sociales de manière durable.",
    "This measure would be beneficial for everyone. Indeed, it would allow for a sustainable reduction in social inequalities."
  ],
  [
    "Car",
    "Because",
    "Il est urgent d'agir car les conséquences de l'inaction seront irréversibles pour les générations futures.",
    "It is urgent to act because the consequences of inaction will be irreversible for future generations."
  ],
  [
    "Parce que",
    "Because",
    "Beaucoup de jeunes quittent les régions rurales parce que les opportunités d'emploi y sont limitées.",
    "Many young people leave rural areas because job opportunities there are limited."
  ],
  [
    "Cela s'explique par",
    "This is explained by",
    "La baisse de la participation électorale s'explique par la perte de confiance des citoyens envers les institutions politiques.",
    "The decline in voter turnout is explained by citizens' loss of trust in political institutions."
  ],
  [
    "Par exemple",
    "For example",
    "Plusieurs pays ont réussi à réduire leurs émissions de carbone, par exemple la Suède et le Danemark.",
    "Several countries have succeeded in reducing their carbon emissions, for example Sweden and Denmark."
  ],
  [
    "Comme",
    "Like / Such as",
    "Certaines villes ont adopté des politiques innovantes, comme Montréal et Vancouver.",
    "Some cities have adopted innovative policies, like Montreal and Vancouver."
  ],
  [
    "Notamment",
    "Notably / In particular",
    "Plusieurs secteurs économiques sont en croissance, notamment les technologies vertes et les énergies renouvelables.",
    "Several economic sectors are growing, notably green technologies and renewable energies."
  ],
  [
    "Donc",
    "So / Therefore",
    "Les ressources naturelles sont limitées, donc nous devons les utiliser de manière responsable et durable.",
    "Natural resources are limited, so we must use them in a responsible and sustainable manner."
  ],
  [
    "Ainsi",
    "Thus / Therefore",
    "Les investissements dans l'éducation ont augmenté, ainsi le niveau de scolarité de la population s'est amélioré.",
    "Investments in education have increased, thus the population's level of education has improved."
  ],
  [
    "Par conséquent",
    "Consequently / Therefore",
    "Le vieillissement de la population s'accélère, par conséquent le système de retraite doit être réformé en profondeur.",
    "The aging of the population is accelerating, consequently the retirement system must be deeply reformed."
  ],
  [
    "Cela permet de",
    "This allows to / This makes it possible to",
    "L'utilisation des énergies renouvelables permet de réduire notre dépendance aux combustibles fossiles.",
    "The use of renewable energies allows us to reduce our dependence on fossil fuels."
  ],
  [
    "Cela entraîne",
    "This leads to / This causes",
    "La hausse du chômage entraîne une augmentation de la pauvreté et des problèmes sociaux.",
    "The rise in unemployment leads to an increase in poverty and social problems."
  ],
  [
    "Cependant",
    "However / Nevertheless",
    "Les progrès technologiques sont impressionnants. Cependant, ils créent aussi de nouveaux défis éthiques et sociaux.",
    "Technological advances are impressive. However, they also create new ethical and social challenges."
  ],
  [
    "Néanmoins",
    "Nevertheless / Nonetheless",
    "La situation économique est difficile. Néanmoins, nous devons continuer à investir dans l'éducation et la recherche.",
    "The economic situation is difficult. Nevertheless, we must continue to invest in education and research."
  ],
  [
    "Toutefois",
    "However / Nevertheless",
    "Le projet est ambitieux et coûteux. Toutefois, ses bénéfices à long terme justifient cet investissement.",
    "The project is ambitious and costly. However, its long-term benefits justify this investment."
  ],
  [
    "Même si",
    "Even if / Even though",
    "Même si les coûts initiaux sont élevés, cette réforme est nécessaire pour l'avenir de notre société.",
    "Even if the initial costs are high, this reform is necessary for the future of our society."
  ],
  [
    "Bien que",
    "Although / Even though",
    "Bien que certains s'opposent à cette mesure, elle reste essentielle pour le bien-être collectif.",
    "Although some oppose this measure, it remains essential for collective well-being."
  ],
  [
    "En conclusion",
    "In conclusion",
    "En conclusion, je pense que cette approche représente la meilleure solution pour répondre aux défis actuels de notre société.",
    "In conclusion, I think that this approach represents the best solution to address the current challenges of our society."
  ],
  [
    "Pour toutes ces raisons",
    "For all these reasons",
    "Pour toutes ces raisons, je suis convaincu que nous devons agir rapidement et de manière décisive.",
    "For all these reasons, I am convinced that we must act quickly and decisively."
  ],
  [
    "Il me semble donc que",
    "It therefore seems to me that",
    "Il me semble donc que les politiques publiques doivent être repensées pour mieux répondre aux besoins de la population.",
    "It therefore seems to me that public policies must be rethought to better respond to the needs of the population."
  ]
]
